{
  "chunk_id": 39,
  "title": "Part 2: – Capital losses",
  "slug": "part-2-capital-losses",
  "enhanced_content": "## Part 2 – Capital Losses\n\n### Continuity of Capital Losses and Carryback Requests\n\nThe current-year capital loss is calculated on Schedule 6. This section establishes the continuity and application of capital losses as tax credits.\n\n#### Establishing Continuity\n\nTo establish continuity of capital losses:\n- Enter the total amount of capital losses (not net capital losses available)\n- The inclusion rate is applied only when the loss is actually used as a credit\n- Indicate the balance of any previous-year capital losses carried forward\n\n**Example**: If your corporation has $100,000 in capital losses from the current year and $50,000 in carried forward losses from previous years, you would enter $100,000 for current losses and $50,000 for carried forward losses.\n\n#### Application of Capital Losses as Tax Credits\n\nNet capital losses can be applied as tax credits in the following ways:\n- Reduce taxable capital gains included as income for the three previous tax years\n- Be carried forward indefinitely for future years\n\n**Example**: If your corporation has $20,000 in net capital losses for 2023, it can:\n- Carry back up to $20,000 to offset capital gains in 2020, 2021, or 2022\n- Carry forward any remaining balance to offset future capital gains\n\n#### Specific Line Items\n\n**Line 205 - Transferred Capital Losses**\nCapital losses transferred from:\n- A predecessor corporation after amalgamation, or\n- A subsidiary after wind-up (where ≥90% of issued shares were owned immediately before wind-up)\n\nThis amount represents unused capital losses available to carry forward at the end of the tax year of the predecessor corporation or subsidiary, including:\n- Any expired ABIL (Allowable Business Investment Loss) as non-capital loss\n- Divided by the inclusion rate for the tax year in which the ABIL was incurred\n\n**Example**: If a subsidiary with a $50,000 capital loss is wound up by a parent corporation owning 95% of its shares, the parent corporation can claim this $50,000 loss as a credit on line 205.\n\n**Line 250 - Other Adjustments**\nThese adjustments typically apply to corporations that:\n- Have undergone an acquisition of control\n- Have losses accrued before acquisition of control that are not deductible as credits after\n- Have losses occurred after acquisition of control that are not deductible as credits before\n\n**Example**: If Corporation A acquires control of Corporation B on June 1, 2023, Corporation B's capital losses from before June 1 may not be deductible as credits after the acquisition, requiring an adjustment on line 250.\n\n**Line 240 - Debt Forgiveness**\nDebt forgiveness under section 80 that reduces the capital losses balance\n- Losses must be reduced in the order established by section 80\n\n**Example**: If a corporation has $30,000 in capital losses and receives $10,000 in debt forgiveness, the capital losses balance must be reduced by $10,000 on line 240.\n\n**Line 220 - Expired ABIL**\nABIL earned as non-capital losses in the 11th previous year\n- Must not have been used against taxable income in the previous 10 years\n- Amount is multiplied by 2\n\n**Example**: If a corporation has $5,000 of ABIL from 2013 that was not used in the past 10 years, it would enter $10,000 ($5,000 × 2) on line 220 for the 2023 tax year.\n\n#### Carryback Process\n\nOn lines 951 to 953, enter the amount of capital loss you carry back to prior years:\n- Line 951: Carryback to first prior year\n- Line 952: Carryback to second prior year\n- Line 953: Carryback to third prior year\n\n**Example**: To carry back $15,000 of capital losses from 2023, with $5,000 to each of 2020, 2021, and 2022:\n- Enter $5,000 on line 951 (for 2022)\n- Enter $5,000 on line 952 (for 2021)\n- Enter $5,000 on line 953 (for 2020)\n\n#### Closing Balance\n\nThe result of this section is the closing balance of available capital losses carried forward to future years (line 280).\n\n#### Inclusion Rate\n\nThe net capital loss amount will be calculated at the 50% inclusion rate.\n\n**Example**: If a corporation has $20,000 in capital losses, the deductible amount for tax purposes is $10,000 ($20,000 × 50%).\n\n### Implementation Notes for Developers\n\nWhen implementing capital loss calculations as tax credits in tax software:\n\n1. **Track Loss Origins**: Maintain records of when capital losses were incurred to properly apply carryback and carryforward rules.\n\n2. **Inclusion Rate Application**: Apply the 50% inclusion rate only when calculating the deductible amount of capital losses as credits, not when tracking the total loss balance.\n\n3. **Special Cases Handling**:\n   - For amalgamations and wind-ups (line 205), verify the 90% ownership threshold\n   - For acquisitions of control (line 250), track the acquisition date to separate pre- and post-acquisition losses\n   - For debt forgiveness (line 240), apply section 80 ordering rules\n   - For ABIL calculations (line 220), implement the 10-year expiry tracking and 2× multiplier\n\n4. **Carryback Logic**:\n   - Implement a three-year lookback window for capital loss carrybacks\n   - Allow users to specify allocation across the three years\n   - Ensure carryback amounts don't exceed available capital gains in those years\n\n5. **Closing Balance Calculation**:\n   - Opening balance + Current year losses - Applied losses - Adjustments = Closing balance\n   - Ensure the closing balance is always non-negative\n\n6. **Credit Application**:\n   - Apply capital losses against capital gains first\n   - Track remaining capital loss balance for future use\n   - Generate appropriate T2 Corporation Income Tax Guide references for audit purposes",
  "original_char_count": 2538,
  "enhanced_char_count": 5577,
  "enhanced_at": "2025-11-04T12:05:59.746874",
  "provider": "glm-api"
}