{
  "chunk_id": 30,
  "title": "Part 7: – Property qualifying for and resulting in an",
  "slug": "part-7-property-qualifying-for-and-resulting-in-an",
  "enhanced_content": "## Part 7 – Allowable Business Investment Loss (ABIL)\n\n### Definition and Qualification\n\nAn Allowable Business Investment Loss (ABIL) arises from the arm's length disposition (or deemed disposition) of:\n\n- Shares of a small business corporation\n- Certain debts owed to the corporation by:\n  - Small business corporations\n  - Certain bankrupt corporations\n  - Certain wound-up corporations\n\n*Note: All corporations mentioned above must deal with the taxpayer at arm's length.*\n\nA small business corporation is defined in subsection 248(1) of the Income Tax Act.\n\n### Practical Example: ABIL Calculation\n\nABC Corp. invested $50,000 in shares of XYZ Inc., a small business corporation. XYZ Inc. went bankrupt, and ABC Corp. sold the shares for $2,000. The $48,000 loss ($50,000 - $2,000) qualifies as a business investment loss, which can be claimed as an ABIL.\n\n### Implementation Considerations for Developers\n\nWhen building tax applications:\n1. Verify that the disposed property qualifies as ABIL-eligible\n2. Check arm's length relationship requirements\n3. Calculate ABIL as: Proceeds of disposition - Adjusted cost base\n4. Apply any applicable limitations or special rules\n\n### Calculation\n\nComplete Part 7 to calculate the business investment losses at amount G.\n\n## Capital Gains Reserve\n\n### General Principle\n\nWhen you don't receive the full proceeds of disposition (typically for real property) until after the end of the tax year, you can defer part of the capital gain to the year the corporation receives the proceeds by establishing a capital gains reserve. This allows spreading a capital gain over a maximum of five years.\n\n### Practical Example: Real Property Disposition\n\nA corporation sells a rental property for $500,000 with an adjusted cost base of $300,000, resulting in a $200,000 capital gain. The buyer pays $300,000 in the year of sale and will pay the remaining $200,000 in equal installments over the next four years. The corporation can claim a capital gains reserve for the portion of the gain attributable to the payments not yet received.\n\n### Special Case: Gifts of Non-Qualifying Securities\n\nA corporation that has made a gift of a non-qualifying security to a qualified donee may claim a reserve for any gain realized on this security. The reserve cannot exceed the eligible amount of the gift.\n\n**Eligible Amount Calculation:**\nThe eligible amount of a gift is the amount by which the fair market value of the property exceeds the amount of any advantage received in respect of the gift.\n\n### Practical Example: Gift of Non-Qualifying Securities\n\nA corporation gifts shares with a fair market value of $100,000 and an adjusted cost base of $60,000 to a registered charity. The corporation receives no advantage for this gift. The eligible amount is $100,000, and the capital gain is $40,000. The corporation can claim a reserve for this gain, subject to the limitations described below.\n\n### Conditions for Claiming Reserve\n\nA reserve can only be claimed if:\n- The donation is not deducted for tax purposes\n- The donee does not dispose of the security\n- The security does not cease to be a non-qualifying security\n\nThis reserve can only be claimed in tax years ending within 60 months of making the gift.\n\n### Reserve Inclusion Requirements\n\nThe reserve must be included in income if:\n- The corporation becomes a non-resident\n- The corporation becomes tax-exempt\n\n### Maximum Reserve Calculation\n\nThe reserve that can be claimed in a tax year cannot exceed the lesser of:\n\n**A. Formula-based Calculation:**\n```\nCapital gain × (Amount not due until after the end of the year ÷ Proceeds of disposition)\n```\n\n**B. Percentage-based Calculation:**\n- Year of disposition: 4/5 of the capital gain\n- Second year: 3/5 of the capital gain\n- Third year: 2/5 of the capital gain\n- Fourth year: 1/5 of the capital gain\n\n### Practical Example: Reserve Calculation\n\nUsing the real property example above:\n- Capital gain: $200,000\n- Amount not due until after year-end: $200,000\n- Proceeds of disposition: $500,000\n\n**Calculation A:**\n$200,000 × ($200,000 ÷ $500,000) = $80,000\n\n**Calculation B (Year of disposition):**\n4/5 × $200,000 = $160,000\n\nThe maximum reserve that can be claimed is the lesser of $80,000 and $160,000, which is $80,000.\n\n### Implementation Considerations for Developers\n\nWhen building tax applications:\n1. Track the timing of proceeds receipt\n2. Calculate both reserve methods and apply the lesser amount\n3. Implement a 5-year maximum reserve period\n4. Handle special cases for gifts of non-qualifying securities\n5. Include logic for reserve inclusion when corporation status changes\n6. Maintain continuity of reserves across tax years\n\n### Reporting Requirements\n\n1. Add the reserve amount deducted in a tax year to income in the following tax year.\n2. Report the reserve opening balance and subtract the reserve closing balance on lines 880 and 885 of Schedule 6.\n3. Show the continuity of capital gain reserves on Schedule 13, Continuity of Reserves.\n\n### References\n\n- Subparagraphs 40(1)(a)(ii) and 40(1)(a)(iii) of the Income Tax Act\n- Subsection 40(1.01) of the Income Tax Act",
  "original_char_count": 2651,
  "enhanced_char_count": 5124,
  "enhanced_at": "2025-11-04T12:04:34.876903",
  "provider": "glm-api"
}