{
  "chunk_id": 36,
  "title": "Part 2: – Other reserves",
  "slug": "part-2-other-reserves",
  "enhanced_content": "## Other Reserves (Part 2)\n\n### Overview\nThis section establishes the continuity of specific tax reserves for corporations. These reserves represent amounts set aside for future obligations that may be deducted from income in the current tax year.\n\n### Types of Reserves\n- Reserve for doubtful debts\n- Reserve for undelivered goods and services not rendered (except for reclamation obligations)\n- Reserve for prepaid rent\n- Reserve for returnable containers\n- Reserve for unpaid amounts\n- Other tax reserves\n\n### Calculation Requirements\n1. **Beginning Balance Calculation (Line 125, Schedule 1):**\n   - Total of reserve balance at beginning of year (Line 270, Schedule 13)\n   - Plus amount of reserve transferred on wind-up/amalgamation (Line 275, Schedule 13)\n\n2. **Ending Balance Reporting (Line 413, Schedule 1):**\n   - Enter the balance at end of year (Line 280, Schedule 13)\n\n### Important Note\nFinancial statement reserve balances should NOT be entered on Schedule 13. Instead:\n- Beginning balance from financial statements → Line 414, Schedule 1\n- Ending balance from financial statements → Line 126, Schedule 1\n\n### References\n- IT-152, Special Reserves – Sale of Land\n- IT-154, Special Reserves\n- IT-442, Bad Debts and Reserves for Doubtful Debts\n\n## Patronage Dividend Deduction (Schedule 16)\n\n### Overview\nThis deduction applies to payments made to customers based on their patronage level. An allocation in proportion to patronage entitles customers to receive payments calculated based on the quantity, quality, or value of goods/products sold or services rendered.\n\n### Eligibility Requirements\n- Payments must be made during the tax year or within 12 months following the tax year\n- Agricultural cooperative corporations may deduct patronage dividends issued as tax-deferred cooperative shares (limited to 85% of income attributable to business with members)\n- Corporations other than credit unions and cooperative corporations cannot deduct patronage dividends paid to non-arm's length persons\n\n### Calculation Process\nComplete Parts 1, 2, and 3 of Schedule 16 to calculate the allowable patronage dividend deduction.\n\n### Example\nA farming cooperative with $100,000 income from business with members could deduct up to $85,000 in patronage dividends issued as tax-deferred cooperative shares.\n\n### Reporting Requirements\n- Enter deduction on Line 416 of Schedule 1\n- Complete Part 5 of Schedule 16 (\"Calculation of income from an active business carried on in Canada (ABI)\")\n- Enter amount from Line 124 at Line 400 of the return\n- File completed Schedule 16 with your return\n\n### Special Election for Members\nEligible members of agricultural cooperative corporations can defer including patronage dividends (in the form of tax-deferred cooperative shares issued before 2026) until the year of disposal. Members may elect to include amounts in income before disposition by submitting a letter with their return specifying the amount to be included.\n\n### References\n- Sections 135 and 135.1\n- IT-362, Patronage Dividends\n\n## Credit Union Deductions (Schedule 17)\n\n### Overview\nCredit unions may deduct bonus interest payments and payments for allocations in proportion to borrowing.\n\n### Provincial Considerations\n- Ontario and British Columbia provide provincial tax reductions for credit unions\n- See provincial sections on pages 110 and 126 respectively\n\n### Eligible Deductions\nA credit union can deduct:\n1. Total bonus interest payments made during the tax year\n2. Payments made to members for allocations in proportion to borrowing\n3. Payments made in the 12 months after the end of the tax year\n\n**Note:** Cannot deduct amounts that could have been deducted in the previous tax year.\n\n### Calculation Requirements\n\n#### Allocations in Proportion to Borrowing\nCalculate at a rate related to:\n- Interest payable by the member on money borrowed from the credit union, OR\n- Amount of money borrowed from the credit union\n\n#### Bonus Interest Payments\nCalculate at a rate related to:\n- Interest payable by the credit union on money standing to the member's credit, OR\n- Amount of money standing to the member's credit\n\n**Important:** The rate must be consistent for all members of the same class.\n\n### Reporting Requirements\n- Complete appropriate parts of Schedule 17\n- Add Lines 305 and 315 of Schedule 17\n- Enter result on Line 315 of Schedule 1\n\n### References\n- Subsections 137(2) and 137(6)\n\n## Scientific Research and Experimental Development (SR&ED) Expenditures Claim (Form T661)\n\n### Overview\nCorporations carrying on business in Canada can claim SR&ED expenditures for work performed in Canada and certain salary/wage expenditures for SR&ED performed outside Canada.\n\n### Filing Requirements\n- File Form T661 to identify expenditures and characterize them as SR&ED expenditures\n- Use the most recent version of Form T661 to avoid processing delays\n- File whether or not claiming an Investment Tax Credit (ITC)\n\n### Critical Deadlines\n- File Form T661 and Schedule 31 within 12 months after the filing due date of the income tax return for the year in which expenditures were made\n- Non-profit corporations must file by the filing due date to avoid late-filing penalties\n\n### Example\nA corporation with a December 31 year-end that files its return on March 31, 2023, must file Form T661 by March 31, 2024, to claim SR&ED expenditures for 2022.\n\n### Penalties\n- $1,000 penalty for incomplete or inaccurate claim preparer information\n- Both corporation and claim preparer may be liable for the penalty\n- SR&ED claim will not be disallowed solely for this reason\n\n### Expenditure Pool\nSR&ED expenditures form a pool that can be:\n- Deducted in the current year to calculate net income for tax purposes, OR\n- Carried forward and deducted in any future year\n\n### Reporting Requirements\n- If SR&ED expenditures included in income statement → Line 118, Schedule 1\n- SR&ED expenditures claimed in the year → Line 411, Schedule 1\n\n### Partnership Considerations\nWhen a corporation is a partnership member:\n- Partnership files Form T661 with T5013 FIN and T5013 SUM\n- Individual members receive T5013 slips showing their share\n- Members do not file Form T661 but should retain T5013 slips\n\n### References\n- Subsections 37(1), 37(11), 149(7), 149(7.1), 162(5.1), and 248(1)\n- Regulation 2900\n- T4088, Scientific Research and Experimental Development (SR&ED) Expenditures Claim – Guide to Form T661\n\n## Losses\n\n### Types of Losses\n- Non-capital loss\n- Farm loss\n- Restricted farm loss\n- Limited partnership loss\n- Capital loss\n\n### Application of Losses\nCorporations can apply unused losses to:\n- Current tax year income\n- Previous tax years (carryback)\n- Future tax years (carryforward)\n\n### Loss Carryback Rules\n- Current-year non-capital loss or farm loss: Can reduce any income or taxable dividends subject to Part IV tax for the three previous years\n- Net capital loss: Can reduce taxable capital gains for the three previous years\n- Restricted farm loss: Can reduce farming income for the three previous years\n- Listed personal property loss: Can reduce capital gains on listed personal property for the three previous years\n\n### Example\nA corporation with a $50,000 non-capital loss in 2023 could:\n1. Apply it against 2023 income\n2. Carry it back to reduce income in 2020, 2021, or 2022\n3. Carry it forward to reduce income in future years\n\n### Loss Carryback Process\n- Use Schedule 4 to request carryback of losses to prior years\n- Attach request to return or send separately to tax centre\n\n### Acquisition of Control Considerations\nSpecial rules apply for calculating and deducting losses following an acquisition of control:\n- Net capital losses\n- Non-capital losses\n- Farm losses\n\n### References\n- Subsections 111(4) and 111(5)\n- IT-302, Losses of a Corporation – The Effect That Acquisitions of Control, Amalgamations, and Windings-Up Have on Their Deductibility – After January 15, 1987",
  "original_char_count": 10929,
  "enhanced_char_count": 7915,
  "enhanced_at": "2025-11-04T12:04:59.172020",
  "provider": "glm-api"
}