{
  "chunk_id": 47,
  "title": "Section 113: contains the authority and the limitations",
  "slug": "section-113-contains-the-authority-and-the-limitat",
  "enhanced_content": "## Line 320 - Deduction of Taxable Dividends\n\n### Legal Authority and Limitations\n- **Section 113**: Governs deductions for dividends received from foreign affiliates\n- **Subsection 138(6)**: Authorizes life insurers to deduct taxable dividends received from taxable Canadian corporations (excluding dividends on term preferred shares acquired in ordinary business operations)\n\n### Implementation\nEnter the total amount of taxable dividends deductible in calculating taxable income on line 320. This amount represents the total from column 240 of Schedule 3.\n\n### Important Notes\n- Stock dividends received from non-resident corporations are excluded from this deduction\n- By deducting taxable dividends from net income/loss (line 300), you may create or increase a non-capital loss for the year\n\n### Example\nA corporation receives $50,000 in taxable dividends from a foreign affiliate and $30,000 from a Canadian corporation. If both amounts qualify under the respective sections, the corporation would enter $80,000 on line 320.\n\n### Reference\nIT-269, Part IV Tax on Taxable Dividends Received by a Private Corporation or a Subject Corporation\n\n## Line 325 - Part VI.1 Tax Deduction\n\n### Eligibility\nCorporations that pay Part VI.1 tax on dividends paid on:\n- Taxable preferred shares\n- Short-term preferred shares\n\n### Calculation\nDeduct 3.5 times the Part VI.1 tax payable:\n```\nLine 325 Amount = Part VI.1 Tax × 3.5\n```\n\n### Example\nIf a corporation pays $10,000 in Part VI.1 tax, the deductible amount on line 325 would be $35,000 ($10,000 × 3.5).\n\n### Reference\nParagraph 110(1)(k)\n\n## Line 331 - Non-capital Losses of Previous Tax Years\n\n### Application\nEnter non-capital losses carried forward from previous years to reduce taxable income from line 130 of Schedule 4.\n\n### Implementation Steps\n1. Enter current-year non-capital losses on line 330 of Schedule 3\n2. Enter previous years' non-capital losses used to reduce dividends subject to Part IV tax on line 335\n3. Enter the total of these amounts as an applied amount on line 135 of Schedule 4\n\n### Example\nA corporation has $20,000 in current-year non-capital losses and $15,000 in carried forward losses from previous years. The corporation would enter $15,000 on line 331 (assuming $20,000 is applied to current year income).\n\n### References\nParagraphs 111(1)(a), 186(1)(c), and 186(1)(d)\n\n## Line 332 - Net-capital Losses of Previous Tax Years\n\n### Application\nEnter net capital losses from previous years applied against taxable capital gains incurred in the current year.\n\n### Calculation\n```\nLine 332 Amount = Capital Loss (Schedule 4, line 225) × 50%\n```\n\n### Important Note\nA net capital loss can create a non-capital loss in the year applied, as it reduces taxable capital gains rather than being limited to reducing taxable income.\n\n### Example\nA corporation has $40,000 in net capital losses from previous years and $30,000 in taxable capital gains in the current year. The corporation can apply $30,000 of the losses against the gains, resulting in a line 332 entry of $15,000 ($30,000 × 50%).\n\n### References\nSection 38, Subsections 111(1.1) and 111(8), Paragraph 111(1)(b)\n\n## Line 333 - Restricted Farm Losses of Previous Tax Years\n\n### Application\nEnter restricted farm losses from previous years to reduce current-year farm income.\n\n### Implementation\n1. Enter the amount on line 333\n2. Enter the amount of restricted farm loss used on line 430 of Schedule 4\n\n### Example\nA corporation with $25,000 in restricted farm losses from previous years and $20,000 in current-year farm income would enter $20,000 on line 333.\n\n### Reference\nParagraph 111(1)(c)\n\n## Line 334 - Farm Losses of Previous Tax Years\n\n### Application\nEnter farm losses carried forward from previous years to reduce taxable income from line 330 of Schedule 4.\n\n### Implementation Steps\n1. Enter current-year farm loss on line 340 of Schedule 3\n2. Enter previous years' farm losses used to reduce dividends subject to Part IV tax on line 345\n3. Enter the total of these amounts on line 335 of Schedule 4 as the amount applied\n\n### Example\nA corporation has $30,000 in current-year farm losses and $20,000 in carried forward farm losses. If $15,000 of the carried forward losses are used to reduce dividends subject to Part IV tax, the corporation would enter $5,000 on line 334 ($20,000 - $15,000).\n\n### References\nParagraphs 111(1)(d), 186(1)(c), and 186(1)(d)\n\n## Line 335 - Limited Partnership Losses of Previous Tax Years\n\n### Application\nEnter the deductible amount of limited partnership losses from previous years applied against other incomes in the current year.\n\n### Implementation\nThe amount should be derived from Part 7 of Schedule 4.\n\n### Example\nA corporation has $10,000 in limited partnership losses from previous years and applies the full amount against other income in the current year. The corporation would enter $10,000 on line 335.\n\n### Reference\nParagraph 111(1)(e)\n\n## Line 340 - Taxable Capital Gains or Taxable Dividends Allocated from a Central Credit Union\n\n### Eligibility\nAvailable to member credit unions when a central credit union has made an election under subsection 137(5.1).\n\n### Application\nMember credit unions can claim amounts allocated as:\n- Taxable dividends\n- Net non-taxable capital gains\n\nThese amounts are deductible from taxable income under paragraph 137(5.2)(c).\n\n### Example\nA member credit union receives $50,000 in taxable dividends and $30,000 in net non-taxable capital gains from its central credit union. The credit union would enter $80,000 on line 340.\n\n## Line 350 - Prospector's and Grubstaker's Shares\n\n### Eligibility\nAvailable for shares received from a corporation in exchange for disposition of an interest in a mining property (unless exempt under a tax treaty).\n\n### Calculation\n1. Initial receipt: Deduct 1/2 of the value of shares received\n2. Upon disposition or exchange: Deduct 1/2 of the lesser of:\n   - Fair market value of shares at time of disposition of mining property\n   - Fair market value of shares at time of disposition or exchange of shares\n\n### Example\nA corporation receives shares valued at $100,000 in exchange for disposition of a mining property. The initial deduction would be $50,000 ($100,000 × 1/2). If the shares are later disposed of when their fair market value is $80,000, the additional deduction would be $40,000 ($80,000 × 1/2).\n\n### Reference\nParagraph 110(1)(d.2)\n\n## Line 352 - Employer Deduction for Non-qualified Securities\n\n### New Rules for Employee Stock Options\nFor employee stock options granted after June 30, 2021:\n- $200,000 annual limit (calendar year basis) on employee stock option grants eligible for preferred tax treatment\n- Exceptions:\n  - Canadian-controlled private corporations (CCPCs)\n  - Non-CCPCs with annual gross revenue of $500 million or less\n\n### Employer Deduction\nIf a security is deemed non-qualified:\n- Employer can claim a deduction equal to the benefit received by the employee\n- This applies where the security would otherwise be deductible under paragraph 110(1)(d)\n\n### Notification Requirements\n1. Employee notification: Written notice that the security is non-qualified within 30 days of agreement\n2. CRA notification: File Schedule 59, Information Return for Non-Qualified Securities, with T2 return\n\n### Example\nAn employee receives stock options with a benefit of $50,000, but they exceed the $200,000 annual limit and are deemed non-qualified. The employer can claim a $50,000 deduction on line 352.\n\n## Line 355 - Section 110.5 Additions or Subparagraph 115(1)(a)(vii) Additions\n\n### Purpose\nAllow corporations to use foreign tax deductions that would otherwise be non-deductible (e.g., when there is no Part I tax payable).\n\n### Application\nCorporations can choose to add an amount to taxable income under:\n- Section 110.5\n- Subparagraph 115(1)(a)(vii)\n\nThis amount forms part of the non-capital loss.\n\n### Restrictions\nCannot add an amount under section 110.5 if it increases:\n- Small business deduction\n- Manufacturing and processing profits deduction\n- Federal logging tax credit\n- Investment tax credit (ITC)\n- Share-purchase tax credit\n- SR&ED investment tax credit\n\nFor authorized foreign banks, cannot add an amount under subparagraph 115(1)(a)(vii) if it increases:\n- Federal logging tax credit\n- Investment tax credit (ITC)\n\n### Example\nA corporation has $10,000 in foreign tax deductions but no Part I tax payable. The corporation can elect to add $10,000 to income under section 110.5, creating a non-capital loss that can be carried forward to future years.",
  "original_char_count": 7668,
  "enhanced_char_count": 8566,
  "enhanced_at": "2025-11-04T12:06:17.768499",
  "provider": "glm-api"
}