{
  "chunk_id": 15,
  "title": "Part 1: – Non-capital losses .................................................",
  "slug": "part-1-non-capital-losses",
  "enhanced_content": "## Non-Capital Losses\n\nA non-capital loss occurs when a taxpayer's allowable deductions from specific sources exceed the income from those sources for a tax year. It is crucial to understand that a non-capital loss is a **deduction**, not a tax credit. It reduces taxable income, whereas a tax credit reduces tax payable directly.\n\nCommon sources of non-capital losses include:\n*   Business losses (from a sole proprietorship or partnership)\n*   Rental property losses\n*   Farming losses\n*   Employment expenses (that exceed eligible employment income)\n\n### Determination of Current-Year Non-Capital Loss\n\nThe current-year non-capital loss is calculated by aggregating all losses from eligible sources. The total loss is the excess of allowable deductions over income from these specific sources.\n\n**Calculation Steps:**\n1.  **Identify Eligible Income:** Sum all income from business, property, rental, and farming activities.\n2.  **Identify Eligible Deductions:** Sum all deductible expenses directly related to those same income sources.\n3.  **Calculate the Loss:** If the total deductions (Step 2) exceed the total income (Step 1), the difference is the current-year non-capital loss.\n\n**Practical Example:**\nA freelance graphic designer operates a sole proprietorship.\n*   Business Income: $80,000\n*   Business Expenses (advertising, home office, supplies): $95,000\n*   Rental Income: $12,000\n*   Rental Expenses (mortgage interest, property tax, insurance): $15,000\n\n**Calculation:**\n*   Total Eligible Income: $80,000 (Business) + $12,000 (Rental) = $92,000\n*   Total Eligible Deductions: $95,000 (Business) + $15,000 (Rental) = $110,000\n*   **Current-Year Non-Capital Loss:** $110,000 - $92,000 = **$18,000**\n\n**Developer Actionability:**\n*   Your application must track income and expenses by source type (e.g., business, rental).\n*   The system should automatically calculate the net result for each source and aggregate them to determine the total non-capital loss for the year.\n\n### Current-Year Farm Loss\n\nFarm losses have specific rules and are categorized as either full or restricted.\n\n*   **Full Farm Loss:** Can be deducted in full against all sources of the taxpayer's income. This typically applies when farming is the taxpayer's chief source of income, or when the loss is not primarily caused by Capital Cost Allowance (CCA).\n*   **Restricted Farm Loss:** Only deductible against income from farming, fishing, or another business. This applies when farming is not the taxpayer's chief source of income, and the loss is primarily due to CCA. The maximum deductible amount is the lesser of the farm loss and $2,500 plus 50% of the farming loss that exceeds $2,500.\n\n**Practical Example:**\nA software developer has a farming operation on the side, which is not their chief source of income. They incur a $15,000 farm loss, of which $12,000 is from CCA.\n\n*   Since the loss is primarily due to CCA, it is a restricted farm loss.\n*   The deductible portion is calculated as: $2,500 + 50% * ($15,000 - $2,500) = $2,500 + $6,250 = $8,750.\n*   The remaining $6,250 ($15,000 - $8,750) is denied for the current year but can be carried forward as a non-capital loss.\n\n**Developer Actionability:**\n*   Implement logic to determine if a farming operation is a \"chief source of income\" for the taxpayer.\n*   Track the proportion of farm losses attributable to CCA.\n*   Apply the restricted farm loss calculation formula when necessary.\n\n### Applying Non-Capital Losses (Carryback and Carryforward)\n\nNon-capital losses can be applied to other taxation years to reduce tax liability. This provides significant tax planning flexibility.\n\n#### Carryback\n\n*   **Period:** Non-capital losses can be carried back **3 years** from the year the loss occurred.\n*   **Purpose:** To recover income tax paid in any of those three preceding years.\n*   **Process:** The taxpayer can file a T1 Adjustment Request (Form T1-ADJ) for the specific year they want to apply the loss against. Alternatively, Form T2038, \"Carryback of a Non-Capital Loss,\" can be filed with the current-year return to automatically generate refunds for prior years.\n\n**Developer Actionability:**\n*   The system should store the user's tax history for at least the past 3 years.\n*   When a loss is calculated, the application should prompt the user to apply it against prior years, showing the potential tax refund for each year.\n*   The system should be able to generate the data required for Form T1-ADJ or T2038.\n\n#### Carryforward\n\n*   **Period:** Any portion of a non-capital loss not used in a carryback can be carried forward for **20 years** from the end of the loss year.\n*   **Purpose:** To reduce taxable income in future profitable years.\n*   **Tracking:** The CRA maintains a record of the available non-capital loss balance. However, taxpayers must keep their own records. The loss balance must be applied against the first available year with taxable income.\n\n**Practical Example:**\nA business incurs a $50,000 non-capital loss in 2023.\n*   The taxpayer carries back $20,000 to their 2021 tax year, resulting in a refund.\n*   The remaining **$30,000** loss is available for carryforward.\n*   In 2025, the business has a net income of $100,000. The taxpayer can apply the $30,000 carryforward to reduce their 2025 taxable income to $70,000.\n*   The remaining balance is now $0. The carryforward expires at the end of the 2043 tax year (2023 + 20 years).\n\n**Developer Actionability:**\n*   Implement a data model to track the unused non-capital loss balance for each taxpayer.\n*   The record must include the original loss amount, the amount used in carrybacks, the amount used in carryforwards, and the expiry year (loss year + 20).\n*   In any given year, the system should automatically check for an available loss balance and suggest applying it against the current year's taxable income.",
  "original_char_count": 368,
  "enhanced_char_count": 5869,
  "enhanced_at": "2025-11-04T12:02:16.944994",
  "provider": "glm-api"
}