{
  "chunk_id": 60,
  "title": "D. Apprenticeship expenditure is defined in",
  "slug": "d-apprenticeship-expenditure-is-defined-in",
  "enhanced_content": "## Investment Tax Credits (ITCs)\n\n### Overview\nInvestment tax credits provide tax incentives for specific business activities. This section outlines the various ITCs available to corporations, their eligibility requirements, calculation methods, and filing procedures.\n\n### Apprenticeship Expenditure\nApprenticeship expenditure is defined in subsection 127(9) of the Income Tax Act.\n\n### Eligible Child Care Space Expenditure (Expired)\nEligible child care space expenditure was previously defined in subsection 127(9), but this definition has been repealed.\n\n**Important**: You can no longer file a claim for this credit, as it expired on March 31, 2017, and transitional measures expired on December 31, 2019. Only unused credits that have not expired can be carried forward for up to 20 tax years following the tax year in which you made the investment.\n\n## ITC for Qualified Property\n\n### Eligibility\nYou can earn ITCs on qualified property acquired mainly for use in designated activities in the Atlantic region.\n\n### Designated Activities\nDesignated activities include, but are not limited to:\n- Manufacturing or processing goods for sale or lease\n- Logging\n- Farming or fishing\n- Storing grain\n- Harvesting peat\n\n**Note**: Eligible machinery and equipment acquired after 2015 and before 2026 for use in Canada mainly for manufacturing and processing goods for sale or lease is included in class 53. These assets qualify as qualified property for the ITC.\n\n### ITC Rate\nThe ITC rate for qualified property is 10%.\n\n### Special Rules for Leasing Corporations\nThe following rules apply to corporations that lease qualified properties such as prescribed machinery and equipment or prescribed energy generation and conservation property to lessees who use the property in designated activities:\n\n#### For Corporations with Principal Business of Leasing\nFor a corporation whose principal business is leasing property, lending money, or purchasing conditional sales contracts, accounts receivable, or other obligations, property acquired for leasing in the ordinary course of business in Canada is considered qualified property.\n\n#### For Manufacturing Corporations\nFor a corporation whose principal business is manufacturing property that it sells or leases, a property is considered qualified property only if the corporation manufactures it and leases it in the ordinary course of its business in Canada.\n\n#### For Sales or Service Corporations\nFor a corporation whose principal business is selling or servicing property, a property is considered qualified property only if it is a type of property that the corporation sells or services, and the property is leased in the ordinary course of business in Canada.\n\n## Scientific Research and Experimental Development (SR&ED) ITC\n\n### Filing Requirements\nYou must file Form T661, Scientific Research and Experimental Development (SR&ED) Expenditures Claim, along with Schedule 31 when claiming an ITC on qualified expenditures for SR&ED.\n\n**Important**: You must identify qualified SR&ED expenditures on Form T661 and Schedule 31 no later than 12 months after the filing due date for the year the expenditures were incurred (without reference to subsection 78(4)).\n\n### SR&ED Qualified Expenditure Pool\nThe SR&ED qualified expenditure pool includes:\n- Qualified SR&ED current expenditures incurred in the year\n- Plus or minus adjustments\n- Plus any qualified expenditures transferred to the corporation under an agreement as outlined in subsection 127(13)\n- Less any qualified expenditures transferred by the corporation under such an agreement\n\nFor agreements under subsection 127(13), use Form T1146, Agreement to Transfer Qualified Expenditures Incurred in Respect of SR&ED Contracts Between Persons Not Dealing at Arm's Length.\n\n### SR&ED Investment Tax Credit Rates\n\n#### General Rate\nCorporations may earn a non-refundable ITC of 15% of the SR&ED qualified expenditure pool at the end of the tax year.\n\n#### Enhanced Rate for CCPCs\nSome Canadian-Controlled Private Corporations (CCPCs) may earn an enhanced ITC at the rate of 35% on the SR&ED qualified expenditure pool, up to their expenditure limit.\n\n### Expenditure Limit for CCPCs\nThe expenditure limit is $3 million and is subject to a phase-out based on the taxable capital employed in Canada of the CCPC and its associated corporations for the previous tax year:\n- The limit begins to decrease when taxable capital reaches $10 million\n- The limit becomes nil at $50 million and higher\n\n**Upcoming Changes**: For tax years beginning on or after December 16, 2024:\n- The expenditure limit will increase from $3 million to $4.5 million\n- The phase-out thresholds will increase from $10 million and $50 million to $15 million and $75 million, respectively\n- CCPCs will have the option to have their annual expenditure limit determined based on gross revenue instead of taxable capital\n- The enhanced refundable SR&ED credit will be extended to Canadian public corporations (with different phase-out rules based on gross revenue over the prior three years)\n\n### Refundability of SR&ED ITCs\n\n#### For Qualifying CCPCs\nQualifying CCPCs eligible to earn a 35% SR&ED ITC are entitled to partial refundability of the credit at a rate of 40% on their capital expenditures.\n\n#### For Non-Qualifying CCPCs\nCCPCs that do not meet the definition of qualifying corporation can earn ITCs at the enhanced rate of 35% on qualified SR&ED expenditures up to their expenditure limit. This ITC can be refunded if it cannot be used in the year to offset Part I tax. The ITC earned on SR&ED expenditures that exceed the expenditure limit is earned at the rate of 15% and is not refundable.\n\n#### For Qualifying Corporations\nCCPCs that meet the definition of qualifying corporation can earn ITCs at the enhanced rate of 35% on qualified SR&ED expenditures up to their expenditure limit. This ITC can be refunded if it cannot be used in the year to offset Part I tax. For qualifying corporations, the ITC earned on SR&ED expenditures that exceed the expenditure limit is earned at the rate of 15%, of which 40% is also refundable.\n\n### Definition of Qualifying Corporation\nA qualifying corporation is a CCPC whose taxable income for the previous tax year (before applying specified future tax consequences) plus the taxable incomes of all associated corporations (before applying specified future tax consequences for tax years ending in the same calendar year) is not more than the total of the qualifying income limits of the corporation and associated corporations for those previous years.\n\nThe qualifying income limit is $500,000. It begins to decrease when the total taxable capital employed in Canada of the corporation and its associated corporations for the previous tax year reaches $10 million and becomes nil at $50 million.\n\n### Associated Corporations Rules\nIf a corporation is associated with one or more CCPCs, you must allocate the expenditure limit among the associated CCPCs on Schedule 49, Agreement Among Associated Canadian-Controlled Private Corporations to Allocate the Expenditure Limit.\n\n**Special Exception**: Corporations may be associated because the same group of persons controls them, but the members of this group do not act together and have no other connection to each other. CCPCs that are associated only because of this definition of a group will not be considered associated for:\n- The refundable ITC on eligible SR&ED expenditures\n- Calculating the expenditure limit\n- Allocating the expenditure limit\n\nFor this exception to apply, one of the corporations must have at least one shareholder who is not common to both corporations.\n\n## Apprenticeship Job Creation Tax Credit\n\n### Credit Calculation\nA corporation can earn a non-refundable ITC equal to 10% of the eligible salaries and wages paid to eligible apprentices employed in the business in the tax year, to a maximum credit of $2,000 per year per apprentice.\n\n### Eligible Apprentice\nAn eligible apprentice is one who:\n- Is working in a prescribed trade\n- Is in the first 24 months of their apprenticeship contract\n- Has a contract registered with Canada or a province/territory under an apprenticeship program designed to certify or license individuals in the trade\n\n**Note**: Prescribed trades include those currently listed as Red Seal Trades. For more information, visit red-seal.ca. The Minister of Finance may prescribe additional trades in consultation with the Minister of Employment and Social Development.\n\n### Eligible Salaries and Wages\nEligible salaries and wages are those payable by the employer to an eligible apprentice for employment in Canada during the tax year and within the first 24 months of the apprenticeship.\n\n**Exclusions**: Eligible salaries or wages do not include:\n- Qualified expenditures incurred by the corporation in a tax year\n- Remuneration based on profits\n- Bonuses\n- Taxable benefits including stock options\n- Certain unpaid remuneration\n\n### Special Rules for Related Employers\nWhen two or more related employers employ an apprentice, special rules apply to ensure that the $2,000 limit is allocated to only one employer.\n\n### Carryforward and Carryback\nAn unused credit can be carried back 3 years and carried forward 20 years.\n\n### Filing Requirements\nComplete parts 19 to 21 of Schedule 31 to calculate the credit.\n\n## Investment Tax Credit (ITC) for Child Care Spaces (Expired)\n\n**Note**: You can no longer earn this credit. It was eliminated for expenditures made after March 21, 2017, as was the transitional measure for eligible expenditures incurred before 2020 under a written agreement entered into before March 22, 2017. You can only carry forward the non-refundable, unused, unexpired credit for 20 tax years.\n\n### Claiming Carryforward\nTo claim the carryforward, complete parts 22 and 23 of Schedule 31.\n\n### Recapture Rules\nThe credit will be added to the taxpayer's tax otherwise payable under Part I of the Act if, at any time within 60 months of the day on which the taxpayer acquired the property:\n- The new child care space is no longer available, or\n- Property that was an eligible expenditure for this credit is sold or leased to another person or converted to another use\n\nFor more information on the recapture, see Line 602.\n\n## Investment Tax Credit (ITC) Claim Procedures\n\n### Deduction Against Tax Payable\nYou can deduct the full amount of ITC against federal Part I tax payable.\n\n#### For Depreciable Property\nIf you are claiming an ITC for a depreciable property, reduce the capital cost of the property in the next tax year by the amount of this year's ITC. For more information, see Schedule 8, \"Column 3 – Cost of acquisitions during the year\".\n\n#### For SR&ED ITC\nIf you are claiming an SR&ED ITC to reduce tax payable or to receive a refund, you must reduce the pool of deductible SR&ED expenditures in the next tax year. For more information, see Line 435 in Guide T4088, Scientific Research and Experimental Development (SR&ED) Expenditures Claim – Guide to Form T661.\n\n### Restriction on Exempt Income\n**Important**: A corporation cannot claim an ITC for an expense or expenditure incurred in the course of earning income if any of that income is exempt income or is exempt from tax under Part I.\n\n### Carryforward and Carryback Rules\nYou can carry forward certain ITCs not previously deducted for 20 years, or carry them back 3 years, to reduce Part I tax. Remember that you can only carry back ITCs to a prior year if you cannot deduct them in the year you earn them.\n\n**Special Rules**: Special rules restrict the carryforward and carryback of ITCs following an acquisition of control.\n\n## When to Complete Schedule 31\n\nComplete Schedule 31 and file it with the return if the corporation:\n- Acquired any qualified property or incurred any qualified expenditures for ITC purposes\n- Is carrying forward unused ITCs from a previous year\n- Is transferring unused ITCs from a predecessor corporation on amalgamation, or from a subsidiary corporation on wind-up\n- Is applying ITCs against Part I tax\n- Is requesting a carryback of unused ITCs to a previous tax year\n- Is requesting a refund of ITCs earned in the year\n\nComplete Schedule 31 and enter the amount of the ITC for the current year on line 652 or 780.\n\n**Important**: Eligibility for an ITC is limited to those expenses or expenditures identified in Schedule 31 filed within 12 months of the filing due date for the tax year in which the expenses were made or incurred (without reference to subsection 78(4)).\n\n## Investment Tax Credit Refund\n\n### SR&ED Refunds for CCPCs\nFor information about CCPCs claiming a refund of ITC for scientific research and experimental development, see \"SR&ED investment tax credit and refund\" above.\n\n### Clean Economy ITCs\n**Note**: The clean economy ITCs are fully refundable. See the details in Line 780.\n\n### Filing Requirements\nYou must file Schedule 31 to claim the ITC refund. On line 780 of your return, enter the ITC refund claim calculated on Schedule 31.\n\n## Part I Tax Payable Calculation\n\nPart I tax payable for the year is calculated as:\n- The basic Part I tax (amount A)\n- Plus:\n  - The personal services business income tax\n  - The additional tax on banks and life insurers\n  - The total labour requirements addition to tax\n  - The amount of recapture of ITC\n  - The refundable tax on the CCPC's or substantive CCPC's investment income (amounts B, C, D, E, and J)\n- Minus:\n  - Any allowable deductions and credits (amount M)\n\nEnter this amount at amount N, and also on line 700 in the \"Summary of tax and credits\" section of your return.",
  "original_char_count": 13486,
  "enhanced_char_count": 13601,
  "enhanced_at": "2025-11-04T12:08:50.327072",
  "provider": "glm-api"
}