{
  "chunk_id": 44,
  "title": "Part 7: – Limited partnership losses",
  "slug": "part-7-limited-partnership-losses",
  "enhanced_content": "## Limited Partnership Losses\n\n### Current-Year Limited Partnership Losses\n\nThis section calculates current-year limited partnership losses that cannot be deducted in the current year but may be carried forward to other taxation years.\n\n#### Documentation Requirements\n\n- **T5013 Slip**: The amount of partnership loss allocated to a limited partner is reported on the T5013, Statement of Partnership Income.\n- **Exempt Partnerships**: If the partnership is exempt from filing T5013 slips, you must file the partnership's financial statements with the corporation's return to substantiate the corporation's share of the partnership loss.\n\n#### Reporting Timing\n\nReport the loss amount in the corporation's tax year that corresponds to the partnership's fiscal period ending date.\n\n#### At-Risk Rules\n\nFor tax years ending after February 26, 2018, the at-risk rules apply to:\n- Partnerships that are themselves limited partners of other partnerships\n- Situations requiring adjustment of a corporation's available non-capital loss and limited partnership loss carryforward balances as if these rules applied in preceding years\n\n#### Calculating At-Risk Amount\n\nEnter the corporation's at-risk amount at the partnership's fiscal period ending in column 606. The amount in column 604 must be from a business (other than farming or fishing) or from property.\n\n**Formula for At-Risk Amount Calculation:**\n```\nAt-Risk Amount = Adjusted cost base of partnership interest\n               + Share of current-year income from partnership\n               - Amounts owed to the partnership\n               - Any amount or benefit intended to protect against loss of investment\n```\n\n#### Exemptions to At-Risk Rules\n\nPartnership interests operating continuously since February 25, 1986, are generally exempt from at-risk rules. However, this exempt status may be lost if either of the following occurred after February 25, 1986:\n- A substantial contribution of capital to the partnership\n- Substantial partnership borrowings\n\n#### Calculating Limited Partnership Loss\n\nThe limited partnership loss equals the difference between:\n1. The corporation's share of the actual partnership loss\n2. The corporation's at-risk amount (reduced by any investment tax credit, clean economy tax credit, farming losses, and resource expenses allocated to the corporation for that fiscal period)\n\nEnter this amount in column 620.\n\n#### Reporting Requirements\n\n- Add the total of column 620 to line 222 of Schedule 1\n- Enter all losses in column 670 to establish continuity of losses\n\n**Example:**\nA corporation has a $50,000 share of partnership loss but an at-risk amount of only $30,000. The limited partnership loss that can be carried forward is $20,000 ($50,000 - $30,000).\n\n### Limited Partnership Losses from Previous Tax Years\n\nComplete this section to apply limited partnership losses from previous years to reduce any type of income in the current year.\n\n**Limitation:** The deductible amount for each partnership is limited to the difference between:\n- The balance of losses for that partnership\n- The corporation's at-risk amount for that partnership (after deducting amounts specified under subparagraph 111(1)(e)(ii))\n\n### Continuity of Limited Partnership Losses\n\nLimited partnership losses can be carried forward indefinitely to future taxation years.\n\n#### Corporate Reorganizations\n\nColumn 664 represents limited partnership losses transferred from:\n- A predecessor corporation after amalgamation\n- A subsidiary after wind-up (where not less than 90% of issued shares in each class were owned by the corporation immediately before wind-up)\n\nThis amount represents the unused limited partnership losses available to carry forward at the end of the predecessor corporation's or subsidiary's tax year ending immediately before the amalgamation or wind-up.\n\n#### Final Carryforward Calculation\n\nThe result of this section is the amount of limited partnership losses to carry forward to later years (column 680).\n\n### References\n\n- Subsection 96(2.1) of the Income Tax Act\n- Interpretation Bulletin IT-232, \"Losses – Their Deductibility in the Loss Year or in Other Years\"\n\n### Implementation Notes for Developers\n\n1. **Data Collection**: Capture T5013 slip information or partnership financial statements\n2. **At-Risk Calculation**: Implement the at-risk amount formula with all required components\n3. **Exemption Logic**: Track partnership history to determine exemption status\n4. **Carryforward Tracking**: Maintain detailed records of loss carryforwards by partnership\n5. **Corporate Structure Changes**: Handle loss transfers during amalgamations and wind-ups\n6. **Integration Points**: Connect with Schedule 1 (line 222) and other relevant tax forms",
  "original_char_count": 4127,
  "enhanced_char_count": 4734,
  "enhanced_at": "2025-11-04T12:05:33.414968",
  "provider": "glm-api"
}