{
  "chunk_id": 27,
  "title": "Part 4: – Other properties",
  "slug": "part-4-other-properties",
  "enhanced_content": "## Part 4 – Other Properties\n\nThis section requires reporting of capital property dispositions during the tax year that were not previously reported in Parts 1, 2, and 3.\n\n### Types of Other Properties\n\n#### Capital Debts Established as Bad Debts\n\nWhen an amount receivable on a capital account becomes a bad debt and you elect to have subsection 50(1) applied on your return, a deemed disposition occurs at year-end. You are considered to have reacquired the debt immediately afterwards at a cost of nil.\n\n**Tax Implications:**\n- This election allows the corporation to claim a bad debt as a capital loss in the current year\n- Any subsequent recovery of that debt will result in a capital gain\n\n**Example:**\nABC Corp. had a $50,000 loan to XYZ Inc. that became uncollectible in 2023. By electing under subsection 50(1), ABC Corp. can claim a $50,000 capital loss in 2023. If XYZ Inc. later pays $30,000 of this debt in 2024, ABC Corp. must report a $30,000 capital gain in 2024.\n\n**References:**\n- Subsection 50(1)\n- IT-159, Capital Debts Established to be Bad Debts\n\n#### Bad Debts Related to Personal-Use Property\n\nUnder subsection 50(2), you can deduct capital losses for bad debts relating to the disposition of personal-use property to an arm's length person.\n\n**Limitations:**\n- The loss amount cannot exceed the gain previously reported on the disposition of the personal-use property\n\n**Example:**\nYou sold a personal-use vehicle for $15,000 (original cost $20,000) to an arm's length person on credit. The buyer later defaults on the payment. You can claim a capital loss of up to $15,000 (the amount of the original disposition), not $20,000 (the original cost).\n\n**Reference:**\n- Subsection 50(2)\n\n#### Foreign Currency Transactions\n\nForeign exchange gains or losses from buying or selling capital properties are treated as capital gains or capital losses.\n\n**Application:**\n- Transactions in foreign currency or foreign currency futures that are not part of business operations can be considered capital dispositions\n\n**Example:**\nA corporation purchases US stocks for $10,000 USD when the exchange rate is 1.25 CAD/USD (cost = $12,500 CAD). It later sells the stocks for $10,000 USD when the exchange rate is 1.35 CAD/USD (proceeds = $13,500 CAD). The corporation realizes a $1,000 capital gain from the foreign exchange fluctuation.\n\n**References:**\n- Subsection 39(2)\n- IT-95, Foreign Exchange Gains and Losses\n\n#### Partnership and Trust Allocations\n\nCapital gains or losses allocated from partnerships and trusts must be reported in this section.\n\n#### Depreciable Property Special Rules\n\nFor dispositions of depreciable property:\n- A capital gain results if proceeds exceed the capital cost\n- Losses on depreciable property do not result in capital losses but rather terminal losses\n\n**Note:** See \"Column 10 – UCC\" (undepreciated capital cost) for information on terminal losses.\n\n### Reporting Requirements\n\nEnter the total amount of gain or loss realized on disposition of other properties at amount D.\n\n**Implementation Notes for Developers:**\n- Create separate input fields for each type of other property disposition\n- Implement validation to ensure bad debt losses on personal-use property don't exceed original disposition proceeds\n- Track foreign exchange rates at time of acquisition and disposition for accurate capital gain/loss calculation\n- For depreciable property, implement logic to distinguish between capital gains and terminal losses\n- Ensure proper categorization of partnership and trust allocations",
  "original_char_count": 2097,
  "enhanced_char_count": 3540,
  "enhanced_at": "2025-11-04T12:03:29.662537",
  "provider": "glm-api"
}