{
  "chunk_id": 38,
  "title": "Section 110.5: or subparagraph 115(1)(a)(vii) – addition",
  "slug": "section-1105-or-subparagraph-1151avii-addition",
  "enhanced_content": "## Foreign Tax Deductions and Farm Loss Credits\n\n### Section 110.5 or Subparagraph 115(1)(a)(vii) - Addition for Foreign Tax Deductions\n\nAny amounts added to taxable income to utilize foreign tax deductions that could not otherwise be deducted from Part I tax.\n\n**Implementation Note:** Developers should track these additions separately as they affect the calculation of taxable income but may have different carryforward rules than other deductions.\n\n**Reference:** See Line 355 on page 74 of the T2 Corporation Income Tax Guide.\n\n### Current-Year Farm Loss\n\n#### Calculation Method\n\nThe current-year farm loss is the lesser of:\n- The net loss from farming or fishing included in income\n- The non-capital loss before deducting the farm loss\n\n#### Detailed Calculation\n\nThe current-year farm loss is whichever of the following amounts is less:\n- The loss from farming or fishing that exceeds the farming or fishing income for the year\n- The amount of the current-year non-capital loss as calculated in Part 1 of Schedule 4 before deducting the farm loss for the year\n\n**Implementation Steps:**\n1. Calculate the farming or fishing loss (income minus expenses)\n2. Calculate the non-capital loss before farm loss deduction\n3. Apply the lesser of these two amounts as the farm loss\n\n**Example:** \nA corporation has:\n- Farming income: $50,000\n- Farming expenses: $120,000\n- Other business income: $30,000\n- Other business expenses: $10,000\n\nCalculation:\n- Farming loss: $120,000 - $50,000 = $70,000\n- Non-capital loss before farm loss: ($70,000 farming loss) + ($30,000 - $10,000) = $90,000\n- Current-year farm loss: lesser of $70,000 and $90,000 = $70,000\n\nEnter the farm loss calculated on line 310 of Schedule 4. The farm loss can also include an amount allocated from a partnership.\n\n**Special Case:** If the result after the calculation shown under Part 1 is negative, enter this result (as positive) on line 110 of Schedule 4 as the current-year non-capital loss.\n\n**Important Note:** You cannot use prior-year losses to create or increase a current-year non-capital loss, except with net capital losses of other years.\n\n**References:**\n- Subsection 111(8)\n- IT-302, Losses of a Corporation – The Effect That Acquisitions of Control, Amalgamations and Windings-Up Have on Their Deductibility – After January 15, 1987\n\n## Continuity of Non-Capital Losses and Carryback Provisions\n\n### Overview\n\nUse this section to establish the continuity of non-capital losses and to carry back a current-year non-capital loss to prior years.\n\n### Carryback and Carryforward Rules\n\nThe current-year non-capital loss can:\n- Reduce any kind of income or taxable dividends subject to Part IV tax\n- Be carried back to the 3 previous tax years\n- Be carried forward to the 20 following tax years\n- Expire after the carry-forward period\n\n**Implementation Note:** Developers should create a tracking system that monitors the expiry dates of non-capital losses to ensure they are utilized before expiration.\n\n### Key Line Items and Their Meanings\n\n#### Line 105 - Non-Capital Losses from Predecessor Corporation\nAmount of non-capital losses transferred from:\n- A predecessor corporation after amalgamation, or\n- A subsidiary after wind-up where not less than 90% of the issued shares in each class were owned by the corporation immediately before the wind-up\n\nThis amount represents the unused non-capital losses available to be carried forward at the end of the tax year of the predecessor corporation or subsidiary ending immediately before the amalgamation or wind-up, minus any expired amount.\n\n#### Line 140 - Debt Forgiveness Reduction\nAmount of debt forgiveness under section 80 that reduces the non-capital losses balance. Losses must be reduced in the order established by section 80.\n\n#### Line 150 - Other Adjustments\nAmount received under subsection 111(10) as a fuel tax rebate that reduced non-capital loss for a previous year, and any other adjustments not previously mentioned.\n\nThese adjustments typically apply to corporations that have undergone an acquisition of control where losses accrued before the acquisition of control are not deductible after the acquisition of control.\n\n### Final Calculation\n\nThe result of this section is the closing balance of non-capital losses carried forward to future years (line 180).\n\n**Implementation Requirement:** Complete Part 6 to establish the balance of non-capital losses by year of origin to ensure proper tracking of expiry dates.",
  "original_char_count": 3100,
  "enhanced_char_count": 4472,
  "enhanced_at": "2025-11-04T12:05:07.632004",
  "provider": "glm-api"
}