{
  "chunk_id": 58,
  "title": "C. pre-production mining expenditures (only",
  "slug": "c-pre-production-mining-expenditures-only",
  "enhanced_content": "## Investment Tax Credits (ITCs)\n\n### Eligible Expenditures for ITC Claims\n\n#### C. Pre-production Mining Expenditures\n- **Note**: Only carry-forward amounts are allowed for claiming\n- These expenditures must be related to mining activities before commercial production begins\n- Typical expenses include exploration, development, and construction of mining infrastructure\n- **Implementation Tip**: Track the original year of expenditure to calculate carry-forward periods correctly\n\n#### D. Apprenticeship Expenditures\n- Eligible expenses include wages paid to eligible apprentices\n- Must be registered apprentices in a designated trade under the Apprenticeship and Certification Act\n- Maximum credit of $2,000 per eligible apprentice per year\n- **Implementation Tip**: Validate apprentice registration numbers and track annual wage payments per apprentice\n\n#### E. Eligible Child Care Space Expenditures\n- **Note**: Only carry-forward amounts are allowed for claiming\n- Applies to businesses that create licensed child care spaces for employees\n- Eligible expenses include construction, renovation, and equipment costs\n- **Implementation Tip**: Track licensing information and categorize expenses by construction, renovation, and equipment\n\n### Clean Economy ITCs\n- For information on clean economy Investment Tax Credits, see Line 780 on page 135 of the T2 Corporation Income Tax Guide\n- **Implementation Tip**: Create a separate module for clean economy ITCs as they have distinct eligibility criteria\n\n### Definitions of Qualified Investments and Expenditures\n\n#### A. Qualified Property\n- **Definition**: As defined in subsection 127(9) of the Income Tax Act\n- **Includes**: \n  - New prescribed buildings\n  - Prescribed machinery and equipment\n  - Prescribed energy and conservation property\n- **Requirements**: Must be acquired during the tax year for use in specific activities in:\n  - Newfoundland and Labrador\n  - Nova Scotia\n  - Prince Edward Island\n  - New Brunswick\n  - The Gaspé Peninsula\n  - Prescribed offshore regions (collectively known as the Atlantic region)\n- **Implementation Tip**: Implement regional validation to ensure property is located in eligible areas\n\n#### A.1 Qualified Resource Property\n- **Definition**: As defined in subsection 127(9) of the Income Tax Act\n- **Status**: This credit expired on December 31, 2015\n- **Transitional Measures**: Expired on December 31, 2016\n- **Carry-forward Provision**: Unused credits can be carried forward for up to 20 tax years following the year of investment\n- **Implementation Tip**: \n  - Block new claims for this credit\n  - Implement date validation to ensure carry-forward claims are within the 20-year window\n  - Example: If investment was made in 2015, carry-forward claims must be made by the end of 2035\n\n#### B. Qualified Expenditure and SR&ED Qualified Expenditure Pool\n- **Definition**: As defined in subsection 127(9) of the Income Tax Act\n- **Related Definition**: Scientific Research and Experimental Development (SR&ED) is defined in subsection 248(1) of the Income Tax Act\n- **Purpose**: These expenditures qualify for the Scientific Research and Experimental Development (SR&ED) Investment Tax Credit\n- **Implementation Tip**: Create a separate pool tracking mechanism for SR&ED expenditures with proper categorization\n\n### Implementation Notes for Developers\n- When building tax applications, ensure proper tracking of carry-forward amounts for expired credits\n- Implement validation checks for regional eligibility of qualified property\n- Create separate tracking mechanisms for different types of expenditures with varying carry-forward rules\n- Consider the 20-year carry-forward limitation for qualified resource property when implementing date calculations\n- Implement proper error handling for claims made after credit expiration dates\n- Consider creating a credit eligibility matrix to quickly determine which credits are available based on tax year and expenditure type",
  "original_char_count": 1267,
  "enhanced_char_count": 3965,
  "enhanced_at": "2025-11-04T12:07:59.717181",
  "provider": "glm-api"
}