{
  "chunk_id": 78,
  "title": "Section 40: of the Taxation Act, 2007 (Ontario), attach a",
  "slug": "section-40-of-the-taxation-act-2007-ontario-attach",
  "enhanced_content": "# Ontario Tax Credits\n\n## Recapture of Ontario Research and Development Tax Credit\n\n### Overview\nA corporation that disposed of property used in scientific research and experimental development (SR&ED), or converted it to commercial use, must report a recapture of any Ontario research and development tax credit previously calculated on that property.\n\n### Implementation Details\n- Any recapture will create or increase Ontario tax otherwise payable\n- Calculate the recapture by completing Schedule 508, Ontario Research and Development Tax Credit\n- Enter the recapture amount on line 277 of Schedule 5\n\n### Example\nIf a corporation claimed $50,000 in Ontario R&D tax credits on equipment that was later sold for commercial use, they may need to recapture a portion of those credits, which would increase their Ontario tax payable.\n\n### Reference\nSection 45, Taxation Act, 2007 (Ontario)\n\n## Ontario Corporate Minimum Tax Credit\n\n### Overview\nThe Ontario corporate minimum tax credit may be deducted from Ontario corporate income tax payable for the tax year.\n\n### Calculation\nThe credit is equal to the least of:\n1. The corporate minimum tax credit available for the tax year\n2. The Ontario corporate income tax payable (before the corporate minimum tax credit) minus the greater of:\n   - The corporate minimum tax after foreign tax credit deduction\n   - The gross special additional tax on life insurance corporations for the tax year\n3. The Ontario corporate income tax payable (before the corporate minimum tax credit) minus the total refundable tax credits for the tax year\n\n### Carryforward Rules\n- The minimum tax credit carryforward at the beginning of the tax year equals the minimum tax and special additional tax paid in previous years, less any minimum tax credit previously deducted or expired\n- Only special additional tax paid in a tax year ending after 2008 is included\n- Credits attributable to tax years ending after March 22, 2007, can be carried forward for 20 years\n- For tax years ending after 2008, the carryforward of credits attributable to tax years ending before March 23, 2007, is extended from 10 to 20 years if the credit did not expire before the beginning of the corporation's first tax year ending after 2008\n\n### Implementation Details\n- Complete Parts 4, 5, and 6 of Schedule 510, Ontario Corporate Minimum Tax\n- Enter the credit amount on line 418 of Schedule 5\n\n### Reference\nSubsections 53(1) to 53(5), Taxation Act, 2007 (Ontario)\n\n## Ontario Community Food Program Donation Tax Credit for Farmers\n\n### Overview\nA non-refundable tax credit is available for farmers who donate agricultural products to community food programs in Ontario.\n\n### Eligibility Requirements\n- A qualifying donation is one or more agricultural products produced in Ontario by an eligible person\n- The donation must be given to an eligible community food program in Ontario\n\n### Credit Calculation\n- The credit equals 25% of the portion of qualifying donations that the corporation deducted under subsection 110.1(1) of the federal Income Tax Act\n- The credit must be claimed in the same year as the charitable gift deduction\n- Charitable gifts are eligible for a five-year carryforward\n\n### Implementation Details\n- File a completed Schedule 2, Charitable Donations and Gifts, with your return\n- Enter the credit amount on line 420 of Schedule 5\n\n### Example\nA farming corporation donates $10,000 worth of Ontario-grown produce to a community food program and claims this as a charitable donation. The corporation can claim a 25% credit ($2,500) on its Ontario tax return.\n\n### Reference\nSection 103.1.2, Taxation Act, 2007 (Ontario)\n\n## Ontario Qualifying Environmental Trust Tax Credit\n\n### Overview\nA corporation that is the beneficiary of a qualifying environmental trust located in Ontario can claim a tax credit on income subject to tax under Part XII.4 of the federal Income Tax Act.\n\n### Credit Details\n- The credit equals the corporation's share of the qualifying environmental trust tax paid by the trust\n- The credit is fully refundable but must first be applied against taxes payable\n- The trust will issue a letter to the beneficiary corporation\n- Keep the letter for your records in case the CRA requests it (do not file with your return)\n\n### Implementation Details\n- Enter the credit amount on line 450 of Schedule 5\n\n### Reference\nSection 87, Taxation Act, 2007 (Ontario)\n\n## Ontario Co-operative Education Tax Credit\n\n### Overview\nA refundable credit available to corporations that provide qualifying work placements at permanent establishments in Ontario for students enrolled in qualifying post-secondary co-operative education programs.\n\n### Eligibility Requirements for Work Placements\nA qualifying work placement must meet all of these conditions:\n- The student performs employment duties under a qualifying co-operative education program\n- The placement is developed or approved by an eligible educational institution\n- The placement requires the student to engage in productive work\n- The placement duration is at least 10 consecutive weeks (except for internship programs: 8-16 consecutive months)\n- The corporation supervises and evaluates the student's performance\n- The institution monitors the student's performance\n- The institution certifies the placement as qualifying\n- The student is paid for the work performed\n\n### Credit Calculation\n- Credit equals an eligible percentage (25% to 30%) of eligible expenditures\n- Maximum credit is $3,000 per qualifying work placement\n- Eligible expenditures include:\n  - Salaries and wages (including taxable benefits) paid to the student\n  - Fees paid to employment agencies for services performed by the student\n\n### Documentation Requirements\n- Keep a copy of the certification letter from the educational institution\n- The letter must include:\n  - Student name\n  - Employer name\n  - Educational institution name\n  - Term of the work placement\n  - Name or discipline of the co-operative education program\n\n### Implementation Details\n- File Schedule 550, Ontario Co-operative Education Tax Credit, with your return\n- Enter the credit amount on line 452 of Schedule 5\n\n### Example\nA corporation hires a co-op student for a 12-week placement at $20/hour for 30 hours per week. The total eligible expenditure is $7,200 ($20 × 30 × 12). At a 25% credit rate, the corporation could claim $1,800 (subject to the $3,000 maximum per placement).\n\n### Reference\nSection 88, Taxation Act, 2007 (Ontario)\n\n## Ontario Computer Animation and Special Effects (OCASE) Tax Credit\n\n### Overview\nA refundable tax credit equal to 18% of qualifying labour expenditures for eligible computer animation and special effects activities incurred by a qualifying corporation for an eligible production.\n\n### Eligibility Criteria\nA corporation must meet all of these requirements:\n- Be a Canadian corporation\n- Perform eligible activities at a permanent establishment in Ontario\n- Not be exempt from tax under Part III of the Taxation Act, 2007 (Ontario)\n- Not be controlled directly or indirectly by corporations with taxable income exempt from tax\n\n### Eligible Expenditures\n- Qualifying labour expenditures equal Ontario labour expenditures less assistance reasonably related to these expenditures\n- For productions with specified labour costs before March 26, 2024: expenditures must be incurred in the tax year\n- For productions without specified labour costs before March 26, 2024: expenditures may be incurred in the tax year or previous year (if not previously claimed)\n- Ontario labour expenditures include salaries, wages, and remuneration directly attributable to activities performed in Ontario\n- Payments must be made within 60 days of the end of the tax year\n\n### Remote Work Considerations\n- Eligible labour expenditures may include remote work done by employees in Ontario\n- The employee must be an Ontario resident who reports to and is under the direction of the applicant with a permanent establishment in Ontario\n\n### Implementation Details\n- File the appropriate schedule with your return\n- Enter the credit amount on the designated line of Schedule 5\n\n### Example\nA qualifying corporation spends $500,000 on eligible Ontario labour expenditures for computer animation work. The OCASE tax credit would be 18% of $500,000, equaling $90,000.\n\n### Reference\nSection 88, Taxation Act, 2007 (Ontario)",
  "original_char_count": 9216,
  "enhanced_char_count": 8376,
  "enhanced_at": "2025-11-04T12:11:35.315152",
  "provider": "glm-api"
}