{
  "chunk_id": 26,
  "title": "Part 3: – Bonds",
  "slug": "part-3-bonds",
  "enhanced_content": "## Part 3: Bonds and Debt Obligations\n\nThis section details the requirements for reporting the disposition of bonds and other debt obligations during the tax year. A disposition includes selling the bond or having it reach maturity.\n\n### Required Information for Each Disposition\n\nFor each bond or debt obligation disposed of, the following data must be collected and recorded:\n\n*   **Issuer Name:** The legal entity that issued the bond.\n*   **Face Value:** The principal amount of the bond that will be repaid at maturity.\n*   **Maturity Date:** The date on which the bond's principal is due to be repaid.\n*   **Date of Disposition:** The date the bond was sold or matured.\n*   **Proceeds of Disposition:** The total amount received from the sale or at maturity.\n\n### Calculating Capital Gains and Losses\n\nThe capital gain or loss is determined by the difference between the proceeds of disposition and the bond's Adjusted Cost Base (ACB). The ACB is typically the original purchase price. The concepts of discount and premium are critical to this calculation.\n\n#### Scenario 1: Disposition of a Discount Bond\nA discount bond is purchased for less than its face value. The discount is generally treated as a capital gain when the bond is disposed of.\n\n**Example:**\n*   An investor purchases a bond with a **face value of $1,000** for **$950**. The ACB is $950.\n*   The investor later sells the bond for **$980**. The proceeds of disposition are $980.\n*   **Capital Gain:** $980 (Proceeds) - $950 (ACB) = **$30**\n\n#### Scenario 2: Disposition of a Premium Bond\nA premium bond is purchased for more than its face value. The premium paid is generally treated as a capital loss when the bond is disposed of or matures.\n\n**Example:**\n*   An investor purchases a bond with a **face value of $1,000** for **$1,050**. The ACB is $1,050.\n*   The investor later sells the bond for **$1,030**. The proceeds of disposition are $1,030.\n*   **Capital Loss:** $1,030 (Proceeds) - $1,050 (ACB) = **-$20**\n\n**Note on Maturity:** If a bond is held to maturity, the proceeds of disposition are its face value. This final transaction will crystallize any remaining capital gain or loss based on the original purchase price (ACB).\n\n### Reporting the Total\n\n1.  Calculate the capital gain or loss for each bond disposition.\n2.  Sum all capital gains from bond dispositions.\n3.  Sum all capital losses from bond dispositions.\n4.  Calculate the net result: (Total Gains) - (Total Losses).\n\nEnter the final net capital gain or loss from all bond dispositions at **Amount C** on the applicable tax form (e.g., Schedule 3).\n\n### Reference\nCRA Interpretation Bulletin IT-479R, \"Transactions in Securities\"",
  "original_char_count": 590,
  "enhanced_char_count": 2679,
  "enhanced_at": "2025-11-04T12:03:38.329993",
  "provider": "glm-api"
}