{
  "chunk_id": 32,
  "title": "Part 9: – Taxable capital gains and total capital losses",
  "slug": "part-9-taxable-capital-gains-and-total-capital-los",
  "enhanced_content": "## Part 9 – Taxable Capital Gains and Total Capital Losses\n\n### Zero Inclusion Rate for Qualified Donations\nGenerally, a zero inclusion rate applies for capital gains arising as a result of a gift to qualified donees of:\n- Securities listed on a designated stock exchange\n- Shares or units of mutual funds\n- Interests in segregated funds\n- Prescribed debt obligations\n- Environmentally sensitive land\n\n**Important Note:** The zero inclusion rate is restricted to only part of the capital gain if the taxpayer is entitled to an advantage or benefit in respect of a gift.\n\n**Implementation Note:** For tax calculation purposes, apply a 0% inclusion rate to eligible donation-related capital gains, unless an advantage or benefit is present, in which case calculate the appropriate reduced inclusion rate based on the benefit's value relative to the total gain.\n\n### Reporting Capital Gains on Donated Securities\nWhen completing this part:\n- Line 895 requires the full amount of capital gains realized on donations of eligible securities to qualified donees\n- This includes securities listed on designated stock exchanges, mutual fund shares/units, segregated fund interests, or prescribed debt obligations\n\n**Example:** If a taxpayer donates publicly traded shares with an adjusted cost base of $5,000 and a fair market value of $15,000 to a registered charity, they would report the $10,000 capital gain on line 895, but with a zero inclusion rate, resulting in no taxable capital gain.\n\n**Implementation Note:** When processing donation-related capital gains, first calculate the full capital gain (FMV - ACB), then apply the appropriate inclusion rate (0% for qualified donations without benefits).\n\n### Flow-Through Share Class Property Donations\nIf you donate property to a qualified donee that is included in a flow-through share class of property, and you have an exemption threshold for the flow-through share class of property, you may be deemed to have an additional capital gain from the disposition of another capital property subject to the standard 50% inclusion rate.\n\n**Implementation Note:** For flow-through share class property donations, check for exemption thresholds and apply the standard 50% inclusion rate to any deemed additional capital gains. The calculation should identify when a donation triggers a deemed disposition of other capital property.\n\n### Adjusted Stub Period Accrual Amounts\nAmounts under section 34.2 (the adjusted stub period accrual regime) that have the character of capital must be:\n- Entered in this part of Schedule 6\n- NOT reported on line 130 of Schedule 1\n\nSince these amounts are deemed to be taxable capital gains/allowable capital losses under the rules in section 34.2, they require special handling in the calculation system.\n\n**Implementation Note:** Ensure section 34.2 amounts with capital character are routed to Schedule 6, Part 9, not to Schedule 1, line 130. These amounts should be flagged during data processing to ensure proper routing.\n\n### Developer Implementation Guidelines\nFor tax application developers implementing this section:\n\n1. **Donation Detection**: Implement logic to identify when a capital property disposition qualifies as a donation to a qualified donee.\n\n2. **Inclusion Rate Application**: Create a function to apply the appropriate inclusion rate:\n   - 0% for qualified donations without benefits\n   - Reduced rate for donations with benefits (calculate proportionally)\n   - 50% for flow-through share class deemed dispositions\n\n3. **Line 895 Calculation**: Ensure the full capital gain amount is calculated and reported, with the inclusion rate applied separately in the taxable capital gain calculation.\n\n4. **Section 34.2 Routing**: Implement a flagging system to identify section 34.2 amounts with capital character and route them to Schedule 6, Part 9.\n\n5. **Validation Rules**: Include validation to ensure:\n   - Qualified donee verification\n   - Proper classification of donated property\n   - Correct application of exemption thresholds for flow-through shares",
  "original_char_count": 1290,
  "enhanced_char_count": 4054,
  "enhanced_at": "2025-11-04T12:04:42.132151",
  "provider": "glm-api"
}