{
  "chunk_id": 16,
  "title": "Part 2: – Capital losses .........................................................",
  "slug": "part-2-capital-losses",
  "enhanced_content": "## Capital Losses: Carryback and Carryforward Rules\n\nThis section details the rules for applying net capital losses to other taxation years. A capital loss is not a tax credit but a deduction that can only be applied against taxable capital gains.\n\n### Core Concepts\n\n*   **Allowable Capital Loss:** For tax purposes, only 50% of a capital loss is considered deductible. This is calculated as:\n    `Allowable Capital Loss = Total Capital Loss × 50%`\n*   **Net Capital Loss:** This occurs when your total allowable capital losses for a year exceed your total taxable capital gains.\n    `Net Capital Loss = Total Allowable Capital Losses - Total Taxable Capital Gains`\n    It is this *net* amount that can be carried back or carried forward.\n\n### Capital Loss Carryback\n\nA net capital loss incurred in a taxation year can be carried back to reduce taxable capital gains reported in any of the three preceding taxation years.\n\n**Purpose:** To recover taxes previously paid on capital gains.\n\n**Process:** The loss must be applied to the earliest of the three years first, then the second earliest, and so on, unless you specify otherwise. To claim a carryback, you must file **Form T1A, Request for Loss Carryback**, with your tax return for the year the loss occurred.\n\n**Example: Carryback Scenario**\n*   **2021:** You reported a **$4,000 taxable capital gain**.\n*   **2022:** You realized a **$10,000 capital loss**, resulting in a **$5,000 net capital loss** ($10,000 × 50%).\n*   **Action:** You can carry back $4,000 of your 2022 net capital loss to 2021.\n*   **Result:** Your 2021 taxable capital gain is reduced to **$0**. You file Form T1A with your 2022 return to request a refund for the tax paid on that $4,000 gain. The remaining $1,000 net capital loss from 2022 can be carried forward.\n\n### Capital Loss Carryforward\n\nIf a net capital loss is not fully applied in the three preceding carryback years, or if you choose not to carry it back, the remaining amount can be carried forward indefinitely to offset future taxable capital gains.\n\n**Purpose:** To reduce tax liability in future years where you have capital gains.\n\n**Example: Carryforward Scenario**\n*   **2021:** You incur a **$6,000 net capital loss**. You have no capital gains in the three prior years (2018, 2019, 2020).\n*   **Action:** The full **$6,000 net capital loss** is carried forward.\n*   **2022:** You have no capital gains. The $6,000 loss pool remains available.\n*   **2023:** You realize a **$10,000 taxable capital gain**.\n*   **Action:** You apply the **$6,000** carried forward loss against your 2023 gain.\n*   **Result:** Your 2023 net taxable capital gain is **$4,000** ($10,000 - $6,000).\n\n---\n\n## Developer Implementation Considerations\n\nWhen building a tax application, accurately modeling capital loss carrybacks and carryforwards is critical for compliance and user value.\n\n### Data Requirements\nFor each capital property disposition, your system must capture:\n*   **Proceeds of Disposition:** The sale price.\n*   **Adjusted Cost Base (ACB):** The original cost plus expenses.\n*   **Date of Disposition:** To determine the taxation year.\n*   **Property Type:** To distinguish between listed securities, real estate, etc., as rules may vary.\n\n### Core Logic & Calculations\n1.  **Annual Calculation:** For each taxation year, calculate the total `Taxable Capital Gains` and total `Allowable Capital Losses`.\n2.  **Net Position:** Determine the net result for the year:\n    *   If `Gains > Losses`, there is a net taxable capital gain.\n    *   If `Losses > Gains`, there is a net capital loss.\n3.  **Loss Pool Management:** Create a data structure to track the user's \"loss pool.\" Each entry in the pool should store:\n    *   The amount of the net capital loss.\n    *   The year it originated.\n\n### Carryback Logic\n1.  When a net capital loss is calculated for year `Y`, check the user's tax records for years `Y-1`, `Y-2`, and `Y-3`.\n2.  Identify any taxable capital gains in those preceding years.\n3.  Apply the loss from year `Y` against gains in `Y-3`, then `Y-2`, then `Y-1`, until the loss is fully used or no more gains are available.\n4.  If a carryback is applied, generate the necessary data for **Form T1A**. This includes the original and revised amounts for the affected years.\n5.  Any remaining loss balance is added to the carryforward pool.\n\n### Carryforward Logic\n1.  In any year with a net taxable capital gain, check the carryforward loss pool.\n2.  Apply losses from the pool against the current year's gain until the gain is eliminated or the pool is exhausted.\n3.  A common and defensible strategy is to apply the **oldest losses first (FIFO)**.\n4.  Update the loss pool by removing the amount of the applied loss.\n\n### Important Caveat: Superficial Loss Rule\nYour application must be aware of the **superficial loss rule**. A capital loss can be denied if, within a period of 30 days before or after the sale, the taxpayer or an affiliated person acquires the same or \"identical\" property. The system should flag transactions that may be subject to this rule to prevent the incorrect claiming of a loss.",
  "original_char_count": 222,
  "enhanced_char_count": 5117,
  "enhanced_at": "2025-11-04T12:02:26.152649",
  "provider": "glm-api"
}