{
  "chunk_id": 9,
  "title": "Section 149: of the Income Tax Act.",
  "slug": "section-149-of-the-income-tax-act",
  "enhanced_content": "## Corporate Tax Credits and Filing Requirements\n\n### Electronic Filing Requirements\n\n#### Mandatory Electronic Filing\nMost corporations are required to file their T2 Corporation Income Tax Return electronically. This requirement applies to all corporations except for those specifically exempt by the Canada Revenue Agency (CRA).\n\n**Key Points:**\n- Corporations that fail to file electronically when required are subject to penalties\n- The $1 million threshold exemption was eliminated for tax years starting after 2023\n- Reference: Subsection 150.1(2.1) and Regulation 205.1(2)\n\n#### Corporation Internet Filing Benefits\nWhen filing electronically using CRA-approved certified software, corporations receive:\n- Immediate confirmation of receipt\n- Faster processing and refunds\n- Reduced mailing costs\n- Environmental benefits through paper reduction\n\n#### T2 Attach-a-doc Service\nThis service allows corporations to attach supporting documentation (such as certificates) when filing their T2 return or within 24 hours of filing.\n\n**Implementation Notes:**\n- Not mandatory for all certified software products\n- Availability varies by software provider\n- Contact your software provider for specific service availability\n\n**Alternative Documentation Submission:**\nIf unable to use T2 Attach-a-doc:\n1. Send documents to your tax center (see \"Where to file your paper return\")\n2. Clearly identify corporation name, business number, and tax year-end on all documents\n\n#### Special Elections\nFor elections without prescribed forms:\n- Include with notes to financial statements on the General Index of Financial Information (GIFI)\n- Transmit electronically with return unless otherwise specified on T2-related forms\n\n**Resources:**\n- List of e-fileable special elections: canada.ca/cra-special-elections-and-returns\n- Eligibility and software information: canada.ca/corporation-internet\n\n### Filing Without Web Access Code\nCorporations can file online without a web access code through:\n- My Business Account (for business owners): canada.ca/my-cra-business-account\n- Represent a Client (for authorized representatives): canada.ca/taxes-representatives\n\n### North American Industry Classification System (NAICS) Codes\n\n#### NAICS Code Requirements\nAll certified T2 tax preparation software uses self-identified NAICS codes to classify business activities.\n\n**Technical Specifications:**\n- Hierarchical numerical codes (up to 6 digits)\n- Used for economic analysis and fiscal policy by all levels of Canadian government\n- Required for active corporations filing electronically or on paper with 2D barcodes\n\n**Implementation Guidelines:**\n- Corporations must select their main revenue-generating business activity\n- First year's selection carries forward to subsequent years\n- Accurate initial selection prevents future validation errors\n\n**Exception:**\nCorporations using the return available on Canada.ca are not required to enter a NAICS code.\n\n**Support:**\nFor NAICS code selection assistance: Business Enquiries line at 1-800-959-5525\n\n### Filing Methods and Deadlines\n\n#### Electronic vs. Paper Filing\nElectronic filing results in the quickest processing time, with 95% of notices of assessment issued within six weeks.\n\n#### Available Return Formats\n1. **T2 Corporation Income Tax Return** (9 pages)\n   - Available to all corporations\n\n2. **T2 Short Return** (2 pages + Schedule 1)\n   - May require additional schedules (Schedule 8, Schedule 50)\n   - Available to eligible corporations only\n\n**T2 Short Return Eligibility:**\nCorporations may use the T2 Short Return if they meet either of these criteria:\n- Canadian-controlled private corporation (CCPC) with nil net income or loss for tax purposes\n- Exempt from tax under section 149 (e.g., non-profit organizations)\n\n**Additional Requirements for T2 Short Return:**\n- Permanent establishment in only one province or territory\n- No refundable tax credits (except refund of instalments paid)\n- No taxable dividends received or paid\n- Reporting in Canadian currency\n- No Ontario transitional tax debit\n- No amount calculated under section 34.2\n\n#### Filing Deadlines\nCorporations must file within six months of tax year-end.\n\n**Deadline Calculation Examples:**\n| Tax Year-End | Filing Deadline |\n|--------------|-----------------|\n| March 31     | September 30    |\n| April 30     | October 31      |\n| June 30      | December 31     |\n| September 23 | March 23        |\n| October 2    | April 2         |\n\n**Special Rules:**\n- When filing due date falls on Saturday, Sunday, or public holiday, returns are considered on time if received or postmarked by next business day\n- Provincial/territorial holidays may affect deadlines\n- Returns must be filed within three years of tax year-end to receive refunds\n\n### Re-appropriation of T2 Statute-barred Credits\n\n#### Process Overview\nUnder subsection 221.2(1), the Minister of National Revenue may re-appropriate T2 statute-barred credits to established debts on accounts with the same business number.\n\n#### Application Methods\n1. **Form RC431** - Request for Re-appropriation of T2 Statute-barred Credits\n   - Complete separate form for each unique business number\n   - Include all supporting documentation\n\n2. **My Business Account** - \"Enquiries service\"\n   - Provide same details as Form RC431\n   - Retain documents for potential CRA request\n\n**Resource:** canada.ca/t2-reappropriation\n\n### Film and Media Tax Credits\n\n#### Specialized Support\nFilm Services Units provide assistance to corporations eligible for:\n- Canadian film or video production tax credit\n- Film or video production services tax credit\n- Provincial film or media tax credits\n\n**Resource:** canada.ca/taxes-film\n\n### Payment Requirements and Methods\n\n#### Instalment Requirements\nCorporations must pay income tax in monthly or quarterly instalments unless total taxes payable (Parts I, VI, VI.1, and XIII.1) for either previous or current year is $3,000 or less.\n\n#### Payment Methods\n1. **Online Banking** - Through Canadian bank or credit union\n2. **My Payment** - canada.ca/cra-my-payment (with activated debit card)\n3. **Pre-authorized Debit (PAD)** - canada.ca/my-cra-business-account\n4. **My Business Account** - \"Proceed to pay\" button\n5. **Third-party Services** - Credit card, Interac e-transfer, or PayPal (with fees)\n6. **In-person** - At Canadian bank, credit union, or Canada Post (with remittance voucher)\n\n**Important Notes:**\n- Payment considered made on day CRA receives it, not when sent\n- Remittance vouchers include QR codes for Canada Post payments\n- Interest and penalties apply to late payments\n\n#### Payment Due Date Rules\nWhen due date falls on Saturday, Sunday, or public holiday, payments are considered on time if received by next business day.\n\n**Resource:** canada.ca/cra-public-holidays\n\n### Instalment Due Dates\n\n#### Standard Schedule\n- Due on last day of each complete month of tax year\n- First payment due one month minus a day from tax year start\n- Subsequent payments due on same day each following month\n\n#### Quarterly Option\nEligible small CCPCs may make quarterly instalment payments instead of monthly.\n\n**Resource:** Guide T7B–Corp, Corporation Instalment Guide\n\n### Balance-due Day\n\n#### Standard Timeline\nGenerally, all corporation taxes (except Part III and Part XII.6) are due two months after tax year-end.\n\n#### Extended Timeline (Three Months)\nApplies when all conditions are met:\n1. Corporation is CCPC throughout tax year\n2. Corporation claims small business deduction for current year or claimed it in previous year\n3. Either:\n   - Previous year's taxable income does not exceed business limit (for non-associated corporations)\n   - Total taxable incomes of all associated corporations for their last tax year ending in previous calendar year does not exceed total of their business limits (for associated corporations)\n\n**Technical Note:** For balance-due day determination, taxable income excludes loss carrybacks.\n\n**Resource:** canada.ca/en/revenue-agency/services/tax/businesses/topics/corporations/corporation-payments/paying-your-balance-corporation-tax\n\n### Partnerships - Limiting Deferral of Corporation Tax\n\nUnder section 34.2, corporations may need to accrue additional income in respect to partnerships (excluding dividends with available deductions).",
  "original_char_count": 14510,
  "enhanced_char_count": 8286,
  "enhanced_at": "2025-11-04T12:01:22.962326",
  "provider": "glm-api"
}