{
  "chunk_id": 41,
  "title": "Part 4: – Restricted farm losses",
  "slug": "part-4-restricted-farm-losses",
  "enhanced_content": "## Part 4 – Restricted Farm Losses\n\n### Current-Year Restricted Farm Loss\n\nA restricted farm loss applies when your chief source of income is neither farming nor a combination of farming and some other subordinate source of income. In such cases, the deductible portion of your farming loss is limited to $17,500 per year.\n\n**Implementation Note:** For tax applications, verify the taxpayer's primary income source before applying this restriction.\n\n**Example:** \nIf a taxpayer has a farming loss of $25,000 but their main source of income is employment (not farming), only $17,500 can be deducted as a restricted farm loss. The remaining $7,500 cannot be claimed in the current year.\n\n**Form Entry:**\n- Enter the restricted amount on line 410 of Schedule 4\n- Add this amount to your income on line 233 of Schedule 1\n\n**Note:** Farm losses allocated from a partnership may also be subject to this restriction.\n\n**References:**\n- Subsection 31(1)\n- IT-232, Losses – Their Deductibility in the Loss Year or in Other Years\n\n### Continuity of Restricted Farm Losses and Carryback\n\nThis section establishes the continuity of restricted farm losses and facilitates carrying back current-year restricted farm losses to prior years.\n\n**Carryback and Carryforward Periods:**\n- Current-year restricted farm losses can reduce farm income for the 20 following tax years\n- They can also be carried back to the 3 previous tax years\n- Losses expire after the carry-forward period\n\n**Implementation Note:** Track the year of origin for each restricted farm loss to properly manage carryback and carryforward periods.\n\n**Special Adjustments:**\n\n#### Line 405 - Transferred Losses\nThis line captures restricted farm losses transferred from:\n- A predecessor corporation after amalgamation\n- A subsidiary after wind-up (where ≥90% of issued shares in each class were owned by the corporation just before wind-up)\n\n**Calculation:** Unused restricted farm losses available at the end of the predecessor's tax year (ending just before amalgamation/wind-up) minus any expired amounts.\n\n#### Line 440 - Debt Forgiveness Adjustment\nThis line accounts for debt forgiveness under section 80 that reduces the restricted farm losses balance. Losses must be reduced in the order established by section 80.\n\n#### Line 450 - Other Adjustments\nThis line captures adjustments for corporations that have undergone an acquisition of control, where losses accrued before the acquisition are not deductible afterward.\n\n**Example:** \nIf a corporation with $10,000 of restricted farm losses undergoes an acquisition of control, these losses may need to be adjusted on line 450 if they are no longer deductible.\n\n**Closing Balance:**\nThe result of this section is the closing balance of restricted farm losses to carry forward to future years (line 480).\n\n**Next Steps:**\nComplete Part 6 to establish the balance of restricted farm losses by year of origin.",
  "original_char_count": 2183,
  "enhanced_char_count": 2915,
  "enhanced_at": "2025-11-04T12:05:18.123544",
  "provider": "glm-api"
}