{
  "chunk_id": 40,
  "title": "Part 3: – Farm losses",
  "slug": "part-3-farm-losses",
  "enhanced_content": "## Part 3 – Farm Losses\n\n### Overview\nUse this section to establish the continuity of farm losses and to carry back a current-year farm loss to previous tax years. Farm losses include losses from farming and fishing businesses.\n\n**Important Note**: Farm losses expire after 20 tax years following the year of the loss.\n\n### Line-by-Line Instructions\n\n#### Line 305: Transferred Farm Losses\nThis line represents the amount of farm losses transferred from:\n- A predecessor corporation after amalgamation, or\n- A subsidiary after wind-up\n\n**Eligibility Requirement**: Not less than 90% of the issued shares in each class must have been owned by the corporation immediately before the wind-up.\n\n**Calculation Method**:\n```\nUnused farm losses available at year-end of predecessor/subsidiary\n- Any expired amounts\n= Amount to enter on Line 305\n```\n\n**Example**: \nIf Corporation A acquired 95% of Corporation B's shares, and Corporation B had $50,000 in unused farm losses with no expired amounts, Corporation A would enter $50,000 on Line 305.\n\n#### Line 340: Debt Forgiveness Adjustments\nEnter any amount of debt forgiveness under section 80 that reduces the farm losses balance.\n\n**Important**: Losses must be reduced in the specific order established by section 80 of the Income Tax Act.\n\n#### Line 350: Other Adjustments\nInclude any other adjustments not previously mentioned, particularly for corporations that have undergone an acquisition of control where losses accrued before the acquisition are not deductible afterward.\n\n### Final Calculation\n\n#### Line 380: Closing Balance\nThe result of this section is the closing balance of farm losses to carry forward to future years.\n\n### Next Steps\n\nComplete Part 6 to establish the balance of farm losses by year of origin, which is essential for tracking the 20-year expiration period of each loss.",
  "original_char_count": 1472,
  "enhanced_char_count": 1846,
  "enhanced_at": "2025-11-04T12:05:14.483811",
  "provider": "glm-api"
}