{
  "chunk_id": 43,
  "title": "Part 6: – Analysis of balance of losses by year",
  "slug": "part-6-analysis-of-balance-of-losses-by-year",
  "enhanced_content": "## Part 6: Analysis of Loss Carryforwards by Year of Origin\n\nThis section provides a detailed breakdown of all available loss balances that can be carried forward to reduce taxable income in future years. It is essential for tracking the remaining amount of each loss incurred, as losses must be applied in a specific order and have different carryforward periods depending on their type.\n\n### Key Concepts for Developers\n\nWhen building a module to handle loss carryforwards, consider the following core principles:\n\n*   **Loss Types:** The system must differentiate between loss types, as they have distinct rules.\n    *   **Non-capital Losses:** Generally incurred from business, property, or employment. Can be carried forward **20 years** and carried back **3 years**. These are the most flexible and can be deducted against any source of income.\n    *   **Capital Losses:** Incurred from the disposition of capital property (e.g., stocks, real estate). Can be carried forward **indefinitely**. Can only be applied against taxable capital gains.\n    *   **Farm/Fishing Losses:** (Restricted vs. General) May have special rules, including an **indefinite** carryforward period for certain portions.\n*   **Year of Origin:** Each loss pool is tracked by the taxation year it was incurred. This is the primary key for organizing the schedule.\n*   **Balance Tracking:** The system must track the `remaining_balance` for each loss pool from each year of origin. As losses are claimed in subsequent years, this balance is reduced.\n\n### Implementation Guidance\n\nA tabular format is the most effective way to present this information to users and for processing.\n\n**Recommended UI/UX Structure:**\n\n| Year of Origin | Type of Loss | Amount Available at Start of Year | Amount Claimed in Current Year | Remaining Balance at End of Year |\n| :--- | :--- | :--- | :--- | :--- |\n| 2023 | Non-Capital | $15,000 | $0 | $15,000 |\n| 2022 | Non-Capital | $8,500 | $8,500 | $0 |\n| 2021 | Capital | $4,000 | $0 | $4,000 |\n| ... | ... | ... | ... | ... |\n\n**Calculation Logic:**\nThe core calculation for each row is straightforward:\n`Remaining Balance = Amount Available at Start of Year - Amount Claimed in Current Year`\n\n**Critical Business Rule:**\nThe Canada Revenue Agency (CRA) requires that losses from the **earliest years** be claimed before losses from more recent years. Your application must enforce this \"first-in, first-out\" (FIFO) logic when a user applies a loss against their current year's income.\n\n### Practical Example\n\n**Scenario:** For the 2023 tax year, a small business has a net income of $20,000 and wants to claim non-capital losses to reduce it to zero. The business has the following historical loss balances:\n\n*   **2021:** $5,000 non-capital loss remaining\n*   **2022:** $18,000 non-capital loss remaining\n\n**Application in Part 6:**\n\nThe system would automatically apply the 2021 loss first, followed by the 2022 loss, as required by the FIFO rule.\n\n| Year of Origin | Type of Loss | Amount Available at Start of Year | Amount Claimed in Current Year (2023) | Remaining Balance at End of Year |\n| :--- | :--- | :--- | :--- | :--- |\n| 2022 | Non-Capital | $18,000 | $15,000 | $3,000 |\n| 2021 | Non-Capital | $5,000 | $5,000 | $0 |\n\n**Explanation:**\n1.  The system first applies the entire $5,000 loss from 2021 against the $20,000 income, reducing the taxable income to $15,000.\n2.  It then applies $15,000 from the 2022 loss pool to bring the taxable income to zero.\n3.  The remaining balance for the 2022 loss is $3,000 ($18,000 - $15,000), which can be carried forward to 2024. The 2021 loss pool is now fully exhausted.",
  "original_char_count": 270,
  "enhanced_char_count": 3634,
  "enhanced_at": "2025-11-04T12:05:48.785911",
  "provider": "glm-api"
}