{
  "chunk_id": 77,
  "title": "Part 4: of Schedule 510, Ontario Corporate Minimum Tax.",
  "slug": "part-4-of-schedule-510-ontario-corporate-minimum-t",
  "enhanced_content": "## Ontario Corporate Minimum Tax\n\n### Schedule 510 Requirements\nLife insurance corporations subject to the special additional tax that are related to another life insurance corporation carrying on business in Canada at the end of the tax year must use Schedule 513, Agreement Among Related Life Insurance Corporations (Ontario), to allocate the capital allowance among the members of the related group.\n\n**Implementation Note:** When building tax calculation logic, ensure that related life insurance corporations first complete Schedule 513 before filing Schedule 512 (if applicable) and Schedule 510 with their return.\n\n### Reporting Requirements\n- Enter the amount of special additional tax payable on line 280 of Schedule 5\n- File Schedule 512 and Schedule 513 (if applicable) with your return\n\n**Reference:** Section 63, Taxation Act, 2007 (Ontario)\n\n## Ontario Political Contributions Tax Credit\n\n### Eligibility Criteria\n**Important:** Effective January 1, 2017, this credit is eliminated for corporations. However, corporations can still claim credits for contributions made before this date.\n\nEligible contributions include those made to:\n- Ontario registered parties\n- Registered constituency associations\n- Registered candidates (as defined under the Ontario Election Finances Act)\n\n### Credit Calculation\nThe non-refundable credit is calculated by:\n```\nCredit Amount = Basic Tax Rate × Ontario Political Contributions\n```\n- The credit is subject to an annual maximum indexed according to the Election Finances Act\n- The basic tax rate is referenced on page 107 of the tax guide\n\n**Example:** If a corporation made $5,000 in eligible political contributions before January 1, 2017, and the basic tax rate is 11.5%, the credit would be $575 ($5,000 × 11.5%).\n\n### Carry Forward Provisions\n- Unused contributions can be carried forward for up to 20 years\n- No carry-back provisions are available\n- Contributions from pre-2009 tax years are also eligible for carry forward\n\n### Documentation Requirements\n- Official receipts are not required to be filed with the return\n- Keep receipts in case the CRA requests them later\n- Photocopies are acceptable only if certified as true copies by the issuer\n\n### Reporting Requirements\n- File Schedule 525, Ontario Political Contributions Tax Credit, with your return\n- Enter the credit amount on line 415 of Schedule 5\n\n**Reference:** Section 53.2, Taxation Act, 2007 (Ontario)\n\n## Ontario Tax Credit for Manufacturing and Processing\n\n### Eligibility Requirements\nCorporations can claim this credit if they meet both conditions:\n1. Had Ontario taxable income during the tax year\n2. Had eligible Canadian profits from:\n   - Manufacturing and processing\n   - Farming\n   - Fishing\n   - Logging\n   - Mining\n   - Generation of electrical energy for sale\n   - Production of steam for sale\n\n**Important:** This credit cannot be claimed on income subject to the Ontario small business deduction rate.\n\n### Claim Process\n- File Schedule 502, Ontario Tax Credit for Manufacturing and Processing, with your return\n- Enter the credit amount on line 406 of Schedule 5\n\n**Reference:** Section 33, Taxation Act, 2007 (Ontario)\n\n## Ontario Credit Union Tax Reduction\n\n### Eligibility Criteria\nCredit unions must meet all three requirements:\n1. Have been a credit union throughout the tax year\n2. Have had a permanent establishment in Ontario at any time in the tax year\n3. Have Ontario taxable income in the year\n\n### Calculation Method\n- Use Part 4 of Schedule 500, Ontario Corporation Tax Calculation, to calculate the reduction\n- Schedule 500 is a worksheet and does not need to be filed with the return\n- The reduction is designed to bring the credit union's overall income tax rate to the same net rate paid by small business corporations claiming the Ontario small business deduction\n\n### Claim Process\n- File Schedule 17, Credit Union Deductions, with your return\n- Enter the reduction amount on line 410 of Schedule 5\n\n**Reference:** Section 35, Taxation Act, 2007 (Ontario)\n\n## Ontario Research and Development Tax Credit\n\n### Eligibility Requirements\nCorporations must:\n1. Have a permanent establishment in Ontario\n2. Have eligible expenditures for scientific research and experimental development (SR&ED) carried out in Ontario\n3. Not be exempt from Ontario corporate income tax\n4. Have no exempt income\n\n### Eligible Expenditures\nAn eligible expenditure must meet all three criteria:\n1. Attributable to a permanent establishment in Ontario\n2. A qualified expenditure under section 127 of the federal Income Tax Act for SR&ED carried on in Ontario\n3. Reduced by government assistance, non-government assistance, or contract payments received, entitled to be received, or reasonably expected to be received\n\n### Credit Calculation\n- The non-refundable credit rate is 3.5% for tax years ending on or after June 1, 2016 (previously 4.5%)\n- If the credit rate changes during the tax year, calculate based on the number of days each rate is in effect\n\n**Example:** For a corporation with $100,000 in eligible SR&ED expenditures in a tax year ending after June 1, 2016, the credit would be $3,500 ($100,000 × 3.5%).\n\n### Carry Forward and Carry Back Provisions\n- Unused credits can be carried back 3 years\n- Unused credits can be carried forward 20 years\n- The current-year credit can be waived in whole or in part under subsection 43(1) of the Taxation Act, 2007 (Ontario)\n\n### Claim Process\n- File Schedule 508, Ontario Research and Development Tax Credit, with your return\n- Attach completed copies of:\n  - Form T661, Scientific Research and Experimental Development (SR&ED) Expenditures Claim\n  - Schedule 31, Investment Tax Credit – Corporations\n- For partnership members, include allocated portion of the credit as provided for in the partnership agreement\n\n**Reference:** Section 41, Taxation Act, 2007 (Ontario)",
  "original_char_count": 5745,
  "enhanced_char_count": 5857,
  "enhanced_at": "2025-11-04T12:10:27.087997",
  "provider": "glm-api"
}