{
  "chunk_id": 52,
  "title": "Part 1: – Aggregate investment income calculation",
  "slug": "part-1-aggregate-investment-income-calculation",
  "enhanced_content": "## Aggregate Investment Income Calculation\n\n### Overview\nAggregate investment income is a critical calculation for determining various tax credits and deductions for corporations. This represents the aggregate world source income calculated through specific additions and deductions.\n\n### Calculation Formula\n```\nAggregate Investment Income = (Eligible Capital Gains + Property Income) - Property Losses\n```\n\n### Calculation Steps\n\n#### Step 1: Calculate Eligible Portion of Taxable Capital Gains\nAdd the eligible portion of taxable capital gains for the year that exceeds:\n- The eligible portion of allowable capital losses for the year\n- Net capital losses from previous years applied in the current year\n\n**Implementation Note**: For developers, ensure your application tracks capital gains and losses separately, with the ability to apply previous year losses to current year gains.\n\n**Example**: If a corporation has $10,000 in taxable capital gains, $3,000 in allowable capital losses for the year, and $2,000 in net capital losses from previous years, the amount to add would be $10,000 - ($3,000 + $2,000) = $5,000.\n\n#### Step 2: Calculate Total Income from Property\nAdd total income from property, including income from a specified investment business carried on in Canada (excluding income from sources outside Canada), after deducting:\n- Exempt income\n- AgriInvest receipts (including Quebec amounts)\n- Taxable dividends deductible after deducting related expenses\n- Business income from an interest in a trust that is considered property income under paragraph 108(5)(a)\n\n**Implementation Note**: Your application should categorize different types of property income and track deductible amounts separately for accurate calculation.\n\n**Example**: If a corporation has $20,000 in property income, $2,000 in exempt income, $1,000 in AgriInvest receipts, and $3,000 in deductible taxable dividends, the amount to add would be $20,000 - ($2,000 + $1,000 + $3,000) = $14,000.\n\n#### Step 3: Calculate Total Losses from Property\nDeduct total losses for the year from property, including losses from a specified investment business carried on in Canada (excluding losses from sources outside Canada).\n\n**Implementation Note**: Ensure your application can distinguish between property losses and other types of losses for accurate deduction.\n\n**Example**: If a corporation has $5,000 in property losses for the year, this amount would be deducted from the total calculated in steps 1 and 2.\n\n### Complete Calculation Example\nUsing the examples above:\n```\nStep 1 (Capital Gains): $5,000\nStep 2 (Property Income): $14,000\nStep 3 (Property Losses): $5,000\n\nAggregate Investment Income = ($5,000 + $14,000) - $5,000 = $14,000\n```\n\n### Reporting\nEnter the calculated aggregate investment income on line 440 of the return, which should match the amount determined on line 092 of Schedule 7.\n\n### Attribution Requirements for CCPCs\nFor Canadian Controlled Private Corporations (CCPCs), taxable capital gains and allowable capital losses can only be included in net investment income if they can be attributed to a period when one of the following entities held the disposed property:\n- CCPC\n- Investment corporation\n- Mortgage investment corporation\n- Mutual fund corporation\n\n**Implementation Note**: Your application should track ownership periods for investment properties to determine eligibility for including gains/losses in aggregate investment income.\n\n### Impact on Tax Credits\nThe aggregate investment income calculation directly affects:\n- Small business deduction eligibility\n- General rate reduction\n- Various other tax credits and deductions\n\n### Related Calculations\nPart 2 of Schedule 7, Adjusted Aggregate Investment Income, is used to calculate the small business deduction for tax years starting after 2018. This calculation is detailed on page 4 of the return.",
  "original_char_count": 1610,
  "enhanced_char_count": 3876,
  "enhanced_at": "2025-11-04T12:07:16.548744",
  "provider": "glm-api"
}