{
  "chunk_id": 56,
  "title": "Section 125.21: ...................................................................",
  "slug": "section-12521",
  "enhanced_content": "## Investment Tax Credits (ITC)\n\n### Federal Qualifying Environmental Trust Tax Credit (Line 648)\n\nEnvironmental trusts that meet specific criteria can claim this credit. The credit is calculated based on the trust's taxable income and is designed to encourage investment in environmental initiatives.\n\n### Investment Tax Credit (Line 652)\n\n#### Available-for-Use Rule\nProperty must be available for use before claiming ITC. The property is considered available for use when it is first used by the claimant for the purpose for which it was acquired.\n\n**Example:** A corporation purchases manufacturing equipment in December 2023 but only begins using it in February 2024. The ITC can only be claimed in the 2024 tax year when the equipment becomes available for use.\n\n#### Qualified Investments and Expenditures\nITC may be claimed for:\n- Scientific research and experimental development (SR&ED)\n- Apprenticeship job creation\n- Child care spaces (eliminated for expenditures after March 21, 2017)\n- Clean economy initiatives\n- Conservation and energy efficiency measures\n\n#### Qualified Activities for ITC\nActivities must be directly related to the specific credit being claimed. For SR&ED, this includes experimental development, basic research, and applied research.\n\n### Scientific Research and Experimental Development (SR&ED)\n\n#### SR&ED Qualified Expenditure Pool\nThe pool includes:\n- Current expenditures (salaries, materials, overhead)\n- Capital expenditures (equipment used in SR&ED)\n- Contract payments for SR&ED performed by others\n\n#### SR&ED Investment Tax Credit and Refund\nThe refundable portion varies by business type:\n- CCPCs: Up to 35% refundable on first $3 million of expenditures\n- Other corporations: Generally 15% non-refundable\n- Partnership expenditures: Flow-through to partners\n\n**Implementation Note:** Developers should track the 20-year recapture period for SR&ED ITCs and implement validation for expenditure eligibility.\n\n### Apprenticeship Job Creation Tax Credit\nCorporations can claim a credit of up to 10% of eligible salaries paid to eligible apprentices, with a maximum credit of $2,000 per apprentice per year.\n\n### Investment Tax Credit (ITC) for Child Care Spaces\n**Note:** This credit is eliminated for expenditures incurred after March 21, 2017.\n\n### Claiming Investment Tax Credits\nComplete Schedule 31 (Investment Tax Credit – Corporations) to claim ITCs. The schedule must be filed with your T2 Corporation Income Tax Return.\n\n### Investment Tax Credit Refund\nRefundable portions of ITCs can be claimed as refunds even if the corporation has no tax payable. Non-refundable portions can only reduce tax payable to zero.\n\n## Part I Tax Calculations\n\n### Base Amount of Part I Tax (Line 550)\n\nThe basic rate of Part I tax is 38% of taxable income. Calculate this by multiplying the taxable income from line 360 by 0.38.\n\n**Formula:** Base Part I Tax = Taxable Income (line 360) × 38%\n\n### Additional Tax on Personal Services Business Income (Line 560)\n\nA corporation must add 5% of its taxable income from a personal services business to its Part I tax payable.\n\n**Formula:** Additional Tax = Personal Services Business Income × 5%\n\n### Additional Tax on Banks and Life Insurers (Line 565)\n\nFor tax years ending after April 7, 2022, an additional 1.5% tax applies to taxable income for members of bank and life insurer groups.\n\n**Key Points:**\n- $100 million taxable income exemption can be allocated among group members\n- For tax years including April 7, 2022, the tax is prorated based on days after that date\n- Complete Schedule 68 to calculate this additional tax\n\n### Labour Requirements Addition to Tax (Line 580)\n\nFor clean economy ITCs (excluding clean technology manufacturing ITC), non-compliance with labour requirements triggers additional tax.\n\n#### Prevailing Wage Requirements\n- Penalty: $20 per day per covered worker not paid prevailing wage (2023 rate, inflation-adjusted annually)\n- Top-up requirement: Difference between required and actual wages plus interest\n- Failure to pay top-up: 120% penalty on the top-up amount\n\n#### Apprenticeship Requirements\n- Penalty: $50 multiplied by the shortfall in required apprentice hours (2023 rate, inflation-adjusted annually)\n- Applies to Red Seal trade apprenticeship requirements\n\n**Implementation Note:** Developers should create tracking mechanisms for prevailing wage compliance and apprentice hour requirements for clean economy ITC claims.\n\n## Tax Credit Recapture\n\n### Recapture of Investment Tax Credit (Line 602)\n\n#### SR&ED ITC Recapture\nWhen SR&ED property is disposed of or converted to commercial use, recapture may be required.\n\n**Recapture Calculation:** Lesser of:\n1. Original ITC earned for the property\n2. Original ITC percentage × Proceeds of disposition (arm's length) or Fair market value (non-arm's length)\n\n**Recapture Period:** 20 years from the date the ITC was claimed\n\n#### Child Care Spaces ITC Recapture\nRecapture occurs if within 60 months of acquisition:\n- The child care space is no longer available\n- The property is sold, leased, or converted to another use\n\n**Recapture Amount:** Lesser of:\n1. Amount reasonably considered part of original ITC\n2. 25% of proceeds of disposition or fair market value (non-arm's length)\n\n#### Clean Economy ITC Recapture\nEnter recapture amounts for each clean economy ITC (except CCUS ITC) in Part 25 of Schedule 31.\n\n## Additional Taxes and Deductions\n\n### Refundable Tax on CCPC's Investment Income (Line 604)\n\nAn additional refundable tax of 10 2/3% applies to investment income (excluding deductible dividends) of:\n- CCPCs throughout the tax year\n- Substantive CCPCs at any time during the tax year (for tax years starting after April 6, 2022)\n\n**Implementation Note:** This tax is added to the NERDTOH pool and refunded when non-eligible dividends are paid to shareholders.\n\n### Federal Tax Abatement (Line 608)\n\nThe federal tax abatement reduces Part I tax payable by 10% of taxable income earned in Canada.\n\n**Formula:** Federal Tax Abatement = Canadian Taxable Income × 10%\n\n**Note:** Income earned outside Canada is not eligible for this abatement.\n\n### Manufacturing and Processing Profits Deduction (Line 616)\n\n#### Basic MPPD\nCorporations with at least 10% of gross revenue from Canadian manufacturing or processing can claim a 13% deduction on income not eligible for the small business deduction.\n\n#### Zero-Emission Technology Manufacturing Deduction\n\n**Reduced Tax Rates:**\n| Tax Year Start | Small Business Rate | General Rate |\n|---------------|-------------------|--------------|\n| 2022-2031     | 4.5%              | 7.5%         |\n| 2032          | 5.625%            | 9.375%       |\n| 2033          | 6.75%             | 11.25%       |\n| 2034          | 7.875%            | 13.125%      |\n| 2035+         | 9%                | 15%          |\n\n**Eligible Activities Include:**\n- Manufacturing of energy conversion equipment (solar, wind, water, geothermal)\n- Manufacturing of air-source heat pumps\n- Zero-emission vehicle manufacturing and components\n- Nuclear energy equipment manufacturing (for tax years starting after 2023)\n- Nuclear fuel processing and recycling\n\n**Implementation Note:** Use Schedule 27 to calculate these deductions. Small manufacturing corporations can use a simplified method, while others must use the basic labour and capital formula.",
  "original_char_count": 12907,
  "enhanced_char_count": 7355,
  "enhanced_at": "2025-11-04T12:07:10.422151",
  "provider": "glm-api"
}