{
  "chunk_id": 45,
  "title": "Part 8: – Election under paragraph 88(1.1)(f)",
  "slug": "part-8-election-under-paragraph-8811f",
  "enhanced_content": "## Tax Credits and Deductions for Corporations\n\n### Election Under Paragraph 88(1.1)(f)\n\nWhen a subsidiary corporation winds up, certain losses incurred by the subsidiary can be transferred to the parent corporation. This includes:\n- Non-capital losses\n- Restricted farm losses\n- Farm losses\n- Limited partnership losses\n\n**Default Treatment**: These losses are deemed to be the parent corporation's losses for its tax year starting after the winding-up begins.\n\n**Election Option**: Under paragraph 88(1.1)(f), the parent corporation may elect to have these losses deemed to be from its previous tax year instead.\n\n**Implementation**: Tick box 190 on the T2 Corporation Income Tax Return if making this election.\n\n**Example**: \nParentCorp winds up SubsidiaryA on June 30, 2023. SubsidiaryA has a $50,000 non-capital loss. By default, ParentCorp can claim this loss in its 2024 tax year. If ParentCorp elects under paragraph 88(1.1)(f), it can claim the loss in its 2023 tax year instead, potentially generating an immediate refund.\n\n### Taxable Income Calculation\n\nTaxable income is calculated by starting with net income and applying specific deductions. The process follows:\n\n1. **Calculate Net Income** (Line 300):\n   - Enter the net income or loss as calculated on Schedule 1\n   - If no adjustments were made to financial statements, enter the income statement amount\n   - Show losses in brackets\n\n**Important Note**: Do not deduct the following items on Schedule 1:\n- Charitable donations\n- Taxable dividends\n- Net capital losses\n- Non-capital losses\n- Farm losses\n- Restricted farm losses\n\nThese items are deducted from net income to arrive at taxable income.\n\n### Charitable Donations (Line 311)\n\n**Eligibility Requirements**:\nComplete Schedule 2 if you made charitable donations during the tax year or received unused donations from:\n- A predecessor corporation after amalgamation\n- A subsidiary corporation after wind-up\n\n**Qualified Donees Include**:\n- Registered charities (including national arts service organizations)\n- Registered journalism organizations\n- Registered Canadian amateur athletic associations\n- Registered housing corporations for low-cost aged housing\n- Canadian municipalities\n- Municipal or public bodies performing government functions\n- United Nations or its agencies\n- Eligible foreign universities with Canadian students\n- Registered foreign charities that received gifts from Canada\n- Federal, provincial, or territorial governments\n\n**Deduction Limitation**:\nThe maximum charitable donation deduction equals 75% of net income (Line 300).\n\n**Limitation Increases**:\nThe 75% limit can be increased by:\n1. 25% of taxable capital gains from gifts of capital property\n2. 25% of taxable capital gains from previous year dispositions of non-qualifying securities\n3. 25% of the lesser of:\n   - Recapture amount from donating prescribed depreciable property\n   - Calculated amount based on eligible amount and proceeds of disposition\n\n**Example**:\nCorporation A has $100,000 net income and made $80,000 in charitable donations. Without limitations, it could only deduct $75,000 (75% of $100,000). However, if it also donated capital property resulting in $20,000 of taxable capital gains, the limitation increases by $5,000 (25% of $20,000), allowing a total deduction of $80,000.\n\n**Carry Forward Rules**:\n- Unused donations can be carried forward for 5 years\n- Donations are deducted in first-in, first-out order\n- Cannot claim donations to create or increase a loss\n\n**Special Considerations**:\n- Credit unions must add back bonus interest payments and proportional borrowing allocations\n- Non-qualifying securities are generally ignored unless disposed of within 60 months\n- Electronic receipts are permitted if secure and non-editable\n\n### Cultural Gifts (Line 313)\n\n**Eligibility Requirements**:\nComplete Part 3 of Schedule 2 if you:\n- Donated certified cultural property\n- Received cultural gifts from amalgamation or wind-up\n\n**Qualified Recipients**:\n- Designated institutions\n- Public authorities\n\n**Deduction Rules**:\n- Maximum deduction equals total eligible amount of current year gifts plus undeducted amounts from 5 previous years\n- Excess can be carried forward for up to 5 years\n- First-in, first-out deduction order applies\n\n**Recent Changes**:\nAfter March 18, 2019, property no longer needs to be of \"national importance\" to qualify for enhanced tax incentives, which include:\n- Enhanced charitable donation deduction\n- Capital gains exemption on disposition\n\n**Example**:\nCorporation B donates artwork with an eligible amount of $50,000 to a designated museum. If Corporation B has $30,000 net income and no other donations, it can deduct $30,000 this year and carry forward $20,000 for up to 5 years.\n\n### Ecological Gifts (Line 314)\n\n**Eligibility Requirements**:\nComplete Part 4 of Schedule 2 if you:\n- Made certified ecological gifts\n- Received ecological gifts from amalgamation or wind-up\n\n**Qualified Recipients**:\n- Federal, provincial, or territorial governments\n- Approved Canadian municipalities\n- Approved registered charities (excluding private foundations)\n\n**Definition**:\nAn ecological gift is ecologically sensitive land (including covenants, easements, or servitudes) certified by the Minister of Environment and Climate Change.\n\n**Deduction Rules**:\n- Maximum deduction equals current year gifts plus unclaimed gifts from 10 previous years (for gifts after February 11, 2014)\n- Excess can be carried forward for up to 10 years\n- First-in, first-out deduction order applies\n\n**Valuation**:\n- The eligible amount is determined by the Minister of Environment and Climate Change\n- Recipients face a 50% tax on fair market value if land use changes without ministerial consent\n\n**Example**:\nCorporation C donates ecologically sensitive land with an eligible amount of $200,000. With $150,000 net income and no other donations, it can deduct $150,000 this year and carry forward $50,000 for up to 10 years.\n\n### Taxable Dividends Deductible (Line 320)\n\n**Implementation**:\nComplete Schedule 3 if you received or paid dividends. This schedule handles:\n- Dividends received deduction\n- Taxable dividends paid\n- Part IV tax calculation\n\n**Reference**:\nSee Parts 3 and 4 of Schedule 3 and \"Line 712 – Part IV tax payable\" for detailed completion instructions.",
  "original_char_count": 14288,
  "enhanced_char_count": 6318,
  "enhanced_at": "2025-11-04T12:05:50.307134",
  "provider": "glm-api"
}