{
  "chunk_id": 29,
  "title": "Part 6: – Listed personal property",
  "slug": "part-6-listed-personal-property",
  "enhanced_content": "## Part 6 – Listed Personal Property (LPP) Dispositions\n\nThis section requires the reporting of all dispositions of Listed Personal Property (LPP) during the corporation's tax year.\n\n### Definition of Listed Personal Property\n\nLPP is a specific category of personal-use property that typically appreciates in value. Gains and losses from its disposition are subject to special rules.\n\nThe following items are classified as LPP:\n-   Prints, etchings, drawings, paintings, sculptures, or other similar works of art\n-   Jewellery\n-   Rare folios, rare manuscripts, or rare books\n-   Stamps\n-   Coins\n\n> **Developer Note:** For form UI, consider implementing a dropdown or selection list with these predefined categories to ensure data integrity and accurate classification.\n\n### Special Treatment of LPP Losses\n\nLosses incurred from the disposition of LPP are restricted. Unlike other capital losses, they can **only** be deducted against capital gains realized from the disposition of *other* LPP. They cannot be used to reduce gains from other types of capital property, such as real estate or stocks.\n\n**Practical Example:**\nA corporation disposes of two assets in the current year:\n1.  Sells a sculpture (LPP) for a **$10,000 capital loss**.\n2.  Sells a rare book collection (LPP) for a **$15,000 capital gain**.\n\n**Calculation:**\nThe $10,000 LPP loss can be fully applied against the $15,000 LPP gain.\n-   Net LPP Gain for the year = $15,000 (Gain) - $10,000 (Loss) = **$5,000**.\n\nThe $10,000 loss could not be used to offset a gain from, for example, selling a commercial building.\n\n### Carryback and Carryforward of Unabsorbed LPP Losses\n\nIf LPP losses exceed LPP gains in the current year, the unabsorbed portion can be applied to other taxation years.\n-   **Carryback:** Apply to reduce net LPP gains in any of the three preceding years.\n-   **Carryforward:** Apply to reduce net LPP gains in any of the seven subsequent years.\n\nDetailed tracking and application of these losses are managed in **Part 5 – Listed personal property losses**.\n\n### Calculation and Form Integration\n\nFollow these steps for accurate reporting and system logic:\n\n1.  **Calculate Current-Year Net Gain/Loss:**\n    Sum all individual gains and losses from LPP dispositions for the tax year.\n    -   `Formula: Σ (Proceeds of Disposition - Adjusted Cost Base)`\n\n2.  **Apply Prior-Year LPP Losses:**\n    Enter the amount of available LPP losses from previous years that you wish to claim in the current year.\n    -   Enter this amount on **line 655** of this schedule.\n    -   Also, enter this amount on **line 530 of Schedule 4, Corporation Loss Continuity and Application**.\n\n3.  **Determine Final Net Amount (Amount F):**\n    Calculate the final amount to be reported.\n    -   `Formula: Amount F = (Current Year Net LPP Gain) - (Amount from line 655)`\n\n4.  **Manage Unabsorbed Losses:**\n    If a net LPP loss remains after applying all available prior-year losses, your application must track this balance. This unabsorbed loss is available for carryback or carryforward according to the rules above.",
  "original_char_count": 1289,
  "enhanced_char_count": 3081,
  "enhanced_at": "2025-11-04T12:04:14.543248",
  "provider": "glm-api"
}