{
  "chunk_id": 13,
  "title": "Chapter 2: – Page 2 of the T2 return",
  "slug": "chapter-2-page-2-of-the-t2-return",
  "enhanced_content": "## T2 Corporation Income Tax Return: Credit-Related Schedules and Forms\n\n### Overview of Credit-Related Attachments\n\nThe T2 Corporation Income Tax Return requires various schedules and forms to calculate and claim tax credits. These attachments fall into two main categories:\n\n- **Information schedules**: Provide details about corporate structure and relationships that affect credit eligibility\n- **Calculation schedules**: Used to calculate specific tax credits and limitations\n\n### Key Schedules for Tax Credits\n\n#### Schedule 23: Agreement Among Associated CCPCs to Allocate the Business Limit\n\n**Purpose**: Allocates the small business deduction (SBD) business limit among associated Canadian-Controlled Private Corporations (CCPCs).\n\n**Requirements**:\n- All associated CCPCs must file Schedule 23\n- Only one corporation needs to file for a calendar year\n- Total allocation cannot exceed 100% of the maximum business limit ($500,000)\n\n**Proration Rules**:\n- For tax years shorter than 51 weeks, prorate based on days in tax year ÷ 365\n- For multiple tax years in same calendar year, use lesser of:\n  - Amount allocated for first tax year\n  - Amount allocated for later tax year\n\n**Example**:\n```\nCorp A and Corp B are associated in 2024.\nCorp A's tax year: Jan 1, 2024 to June 30, 2024 (181 days)\nBusiness limit allocated: $100,000\n\nProrated limit = $100,000 × (181 ÷ 365) = $49,589\n```\n\n#### Schedule 49: Agreement Among Associated CCPCs to Allocate the Expenditure Limit\n\n**Purpose**: Allocates the expenditure limit for the 35% Scientific Research and Experimental Development (SR&ED) Investment Tax Credit (ITC).\n\n**Requirements**:\n- Required for all associated CCPCs with SR&ED expenditures\n- Only one corporation needs to file for a calendar year\n- Identifies all associated corporations and allocates expenditure limit\n\n**Proration Rules**:\n- For multiple tax years in same calendar year, prorate based on days in tax year ÷ 365\n- Ensure prorated amounts equal allocation for first tax year in calendar year\n\n### Other Schedules Impacting Credits\n\n#### Schedule 9: Related and Associated Corporations\n\n**Purpose**: Identifies corporate relationships that affect credit eligibility.\n\n**Association Rules** (Corporations are associated if any apply):\n1. One controls the other\n2. Both controlled by same person/group\n3. Each controlled by related persons with ≥25% cross-ownership\n4. One controlled by person related to group controlling other\n5. Each controlled by related groups with full member relationships\n6. Associated with same third corporation (subsection 256(2))\n\n**Example**:\n```\nCorp X owns 100% of Corp Y voting shares\nCorp Y owns 51% of Corp Z voting shares\n\nResult: Corp X associated with both Corp Y (direct) and Corp Z (indirect)\n```\n\n#### Schedule 28: Election Not to be Associated Through a Third Corporation\n\n**Purpose**: Allows CCPCs to elect that two corporations associated through a third corporation are not associated for SBD purposes.\n\n**Impact**:\n- Third corporation's business limit becomes zero\n- Investment income from other corporations ineligible for SBD\n- Must file annually for each applicable tax year\n\n#### Schedule 130: Excessive Interest and Financing Expenses Limitation (EIFEL)\n\n**Purpose**: Limits deductible interest and financing expenses to 30% of adjusted taxable income (40% for transitional period).\n\n**Applicability**:\n- Tax years starting on or after October 1, 2023\n- Excludes entities with:\n  - Taxable capital < $50M (CCPCs and associated corporations)\n  - Net interest expenses ≤ $1M\n  - Limited non-resident ties\n\n**Implementation Notes for Developers**:\n1. Track association relationships throughout tax year\n2. Implement proration calculations for short tax years\n3. Handle multiple tax years ending in same calendar year\n4. Validate total allocations don't exceed limits\n5. Account for election filings (Schedule 28)\n6. Apply EIFEL rules where applicable\n\n### Reference Materials\n\n- **Forms and Schedules**: Available at canada.ca/cra-forms-publications\n- **GIFI Requirements**: See Guide RC4088\n- **Technical Guides**: IT-64 (Corporations: Association and Control)\n- **EIFEL Information**: canada.ca/cra-eifel\n\n### Filing Requirements\n\n- Attach applicable schedules when responding \"yes\" to related questions on T2 return pages 2-3\n- File electronically to avoid paper financial statement requirements\n- Maintain documentation for all credit calculations and allocations\n- Respect filing deadlines to avoid penalties\n\nFor complete schedule listings and detailed requirements, refer to the T2 Corporation Income Tax Guide.",
  "original_char_count": 36540,
  "enhanced_char_count": 4592,
  "enhanced_at": "2025-11-04T12:01:41.184033",
  "provider": "glm-api"
}