{
  "chunk_id": 19,
  "title": "Part 5: – Listed personal property losses...........................",
  "slug": "part-5-listed-personal-property-losses",
  "enhanced_content": "## Listed Personal Property (LPP) Losses\n\n### Definition of Listed Personal Property (LPP)\nListed personal property (LPP) is a specific class of capital property defined by the Canada Revenue Agency (CRA). It typically includes:\n*   Prints, etchings, drawings, paintings, sculptures, or other similar works of art\n*   Jewellery\n*   Rare books, folios, or manuscripts\n*   Stamps or coins\n\nIn a tax application, a property must be correctly identified as LPP at the time of data entry to apply the appropriate loss treatment rules.\n\n### Treatment of LPP Losses\nA loss from the sale of LPP is considered a capital loss. However, unlike typical capital losses (e.g., from selling stocks or real estate), **LPP losses can only be deducted against capital gains from the disposition of other LPP.**\n\nThey cannot be used to reduce:\n*   Capital gains from other types of property (like stocks or mutual funds)\n*   Other types of income (like employment or business income)\n\n### Practical Example: LPP Loss vs. Typical Capital Gain\nA taxpayer has the following transactions in the tax year:\n1.  Sells a painting (LPP) for a **$2,000 capital loss**.\n2.  Sells shares of a public corporation (non-LPP) for a **$5,000 capital gain**.\n\n**Result:** The taxpayer cannot use the $2,000 LPP loss to offset the $5,000 gain from the shares. Their taxable capital gain for the year is $5,000 (50% of $5,000 = $2,500). The $2,000 LPP loss is unavailable for the current year and must be carried back or carried forward.\n\nIf the taxpayer had also sold a sculpture (LPP) for a **$5,000 capital gain**, the calculation would be:\n*   Total LPP Gains: $5,000\n*   Total LPP Losses: $2,000\n*   **Net LPP Gain:** $5,000 - $2,000 = **$3,000**\n\nIn this scenario, $3,000 would be reported as the net capital gain, and 50% ($1,500) would be included as income.\n\n### Carryback and Carryforward of LPP Losses\nIf an LPP loss cannot be used in the current year because there are no other LPP gains, it can be:\n*   **Carried back:** Applied against LPP gains realized in any of the three preceding taxation years. A formal request must be made using **Form T1A, Request for Loss Carryback**.\n*   **Carried forward:** Applied against LPP gains in any future taxation year indefinitely. These carryforwards are tracked on **T1 Schedule 3, Capital Gains**.\n\n### Continuity of LPP Loss (Superficial Loss Rule)\nA loss on the sale of LPP may be denied if the taxpayer (or a person affiliated with them) acquires the same or identical property during the period that begins 30 days before the sale and ends 30 days after the sale. This is known as the superficial loss rule, adapted for LPP. If this condition is met, the loss is not immediately deductible and is instead added to the adjusted cost base of the new property.\n\n### Implementation Notes for Tax Applications\nWhen building logic for LPP losses, consider the following:\n\n*   **Data Collection:** Ensure the capital property input form includes a boolean flag or a dropdown to classify an asset as `isLPP`.\n*   **Calculation Logic:**\n    1.  Calculate the gain or loss for each disposition: `Gain/Loss = Proceeds of Disposition - Adjusted Cost Base`.\n    2.  Separate all capital transactions into two groups: `LPP_Transactions` and `Non_LPP_Transactions`.\n    3.  Calculate the net gain/loss for each group separately.\n*   **Netting Rule:** The core business logic must enforce that `Net_LPP_Loss` can only reduce `Net_LPP_Gain`. It cannot reduce `Net_Non_LPP_Gain`.\n    *   `Net_Capital_Gain_for_Year = Net_Non_LPP_Gain + max(0, Net_LPP_Gain - |Net_LPP_Loss|)`\n    *   `Unused_LPP_Loss = max(0, |Net_LPP_Loss| - Net_LPP_Gain)`\n*   **Carryback/Carryforward Logic:**\n    *   The `Unused_LPP_Loss` becomes the amount available for carryback and carryforward.\n    *   If implementing a carryback feature, integrate with the logic for **Form T1A**.\n    *   The remaining available balance after carryback must be stored and rolled forward to the next year on Schedule 3.\n*   **Continuity Rule Validation:** Implement a check for each LPP disposition. Query the user's data for any acquisition of the *same property* within the `disposition_date - 30_days` to `disposition_date + 30_days` window. If found, flag the loss as denied and adjust the ACB of the newly acquired property.",
  "original_char_count": 200,
  "enhanced_char_count": 4293,
  "enhanced_at": "2025-11-04T12:02:52.632477",
  "provider": "glm-api"
}