{
  "chunk_id": 35,
  "title": "Part 1: – Capital gains reserves",
  "slug": "part-1-capital-gains-reserves",
  "enhanced_content": "## Capital Gains Reserves\n\nA capital gains reserve allows a taxpayer to defer a portion of a capital gain when the proceeds from the sale of a property are not due until after the end of the taxation year. This reserve is deducted in the year of sale and then brought back into income over a maximum of five years.\n\n### Core Principles and Calculation Logic\n\n#### 1. Continuity of Reserves per Property\nA separate reserve calculation must be maintained for each distinct property disposed of. You cannot aggregate reserves from multiple properties into a single calculation. This continuity must be tracked year-over-year until the reserve is fully brought into income.\n\n#### 2. Inclusion of Predecessor Corporation Reserves\nUnlike other types of reserves, the calculation for the current year must include the total capital gains reserves deducted by both your corporation and its predecessor corporation in the preceding taxation year. This rule ensures continuity in situations involving corporate amalgamations or reorganizations.\n\n#### 3. Calculation on Schedule 6\nThe net taxable capital gain for the year is calculated on `Schedule 6`. The fundamental logic is as follows:\n\n1.  **Start** with the total capital gains realized in the current year.\n2.  **Add back** the total reserve claimed in the previous year (by your corporation and its predecessor).\n3.  **Subtract** the new reserve you are claiming for the current year.\n\nThe result is the capital gain to be included in income for the current year.\n\n---\n\n### Practical Example\n\n**Scenario:** Your corporation sells a commercial building in 2023 for a $500,000 capital gain. The sale agreement stipulates that 20% of the proceeds ($100,000) are not payable until 2025. The maximum reserve claim is limited to the amount of proceeds not received.\n\n**Year 1 (2023):**\n*   **Total Capital Gain:** $500,000\n*   **Maximum Reserve Allowed (20% of gain):** $100,000\n*   **Calculation for Schedule 6:**\n    *   Capital Gains: $500,000\n    *   Add: Reserve from previous year (2022): $0\n    *   Less: Reserve claimed for current year (2023): $100,000\n*   **Taxable Capital Gain for 2023:** $400,000\n\n**Year 2 (2024):**\n*   No new capital gains are realized.\n*   The reserve from 2023 must be added back into income. A new reserve can be claimed for the proceeds still not received (up to 2/5 of the original gain, which is $200,000, but limited to the outstanding proceeds).\n*   **Calculation for Schedule 6:**\n    *   Capital Gains: $0\n    *   Add: Reserve from previous year (2023): $100,000\n    *   Less: Reserve claimed for current year (2024): $100,000 (assuming proceeds are still not received)\n*   **Taxable Capital Gain for 2024:** $0\n\n**Year 3 (2025):**\n*   The final payment is received. The remaining reserve must be brought into income.\n*   **Calculation for Schedule 6:**\n    *   Capital Gains: $0\n    *   Add: Reserve from previous year (2024): $100,000\n    *   Less: Reserve claimed for current year (2025): $0 (no proceeds outstanding)\n*   **Taxable Capital Gain for 2025:** $100,000\n\n---\n\n### Implementation Guidance for Developers\n\n#### Data Model Considerations\nTo accurately track and calculate capital gains reserves, your application should store the following data points for each disposition:\n*   `propertyID`: A unique identifier for the disposed property.\n*   `taxationYear`: The year of the sale.\n*   `totalCapitalGain`: The full capital gain from the disposition.\n*   `proceedsReceivedInYear`: The portion of proceeds received in the current year.\n*   `outstandingProceeds`: The portion of proceeds not yet received.\n*   `reserveClaimedCurrentYear`: The reserve amount calculated and claimed for the current year.\n*   `reserveFromPreviousYear`: The reserve amount claimed in the preceding year (this must be fetched from the prior year's data for the same `propertyID`).\n\n#### Calculation Algorithm\nThe core logic for calculating the taxable capital gain for a given property in a specific year can be represented as:\n\n```javascript\n// Pseudo-code for calculating taxable gain for a single property in a given year\nfunction calculateTaxableCapitalGain(currentYearGain, previousYearReserve, currentYearReserve) {\n  const taxableGain = (currentYearGain + previousYearReserve) - currentYearReserve;\n  return Math.max(0, taxableGain); // Ensure the result is not negative\n}\n\n// The total taxable capital gain is the sum of this calculation across all properties.\n```\n\n#### Form Integration\nThe final calculated taxable capital gain for the corporation is the sum of the individual calculations for all properties. This aggregate value is reported on `Schedule 6` of the `T2 Corporation Income Tax Return`.\n\nFor detailed instructions and specific line references, consult the T2 Corporation Income Tax Guide.",
  "original_char_count": 355,
  "enhanced_char_count": 4784,
  "enhanced_at": "2025-11-04T12:05:08.821144",
  "provider": "glm-api"
}