{
  "chunk_id": 82,
  "title": "2. If you have not been able to resolve your service-",
  "slug": "2-if-you-have-not-been-able-to-resolve-your-servic",
  "enhanced_content": "## Service Issue Resolution Process\n\n### Escalation Path for Service-Related Issues\nIf you have not been able to resolve your service-related issue with a CRA employee, you can request to discuss the matter with the employee's supervisor. This is the first step in the formal escalation process.\n\n### Filing a Service-Related Complaint\nIf the problem remains unresolved after speaking with a supervisor, you can file a formal service-related complaint by:\n1. Completing Form RC193, Service Feedback\n2. Submitting it through the official channel at canada.ca/cra-service-feedback\n\n### Escalating to the Taxpayers' Ombudsperson\nIf you are not satisfied with how the CRA has handled your service-related complaint, you have the option to submit a complaint to the Office of the Taxpayers' Ombudsperson. This is an independent body that reviews complaints about CRA service.\n\n## Reprisal Complaints\n\n### When to File a Reprisal Complaint\nIf you have received a response regarding a previously submitted service complaint or a formal review of a CRA decision and believe you were not treated impartially by a CRA employee, you may submit a reprisal complaint.\n\n### How to File a Reprisal Complaint\n1. Complete Form RC459, Reprisal Complaint\n2. Submit it through the official channel at canada.ca/cra-reprisal-complaints\n\n## Due Date Considerations\n\n### Payment Timing Rules\nWhen a due date falls on a Saturday, Sunday, or public holiday recognized by the CRA, your payment is considered on time if the CRA receives it on or before the next business day.\n\nFor developers building tax applications, this means:\n- Implement a holiday calendar check for CRA-recognized holidays\n- Adjust due dates that fall on weekends or holidays to the next business day\n- Display both the original due date and the effective payment deadline\n\nFor more information on important dates, visit canada.ca/important-dates-corporations.\n\n## Non-Resident Corporation Enquiries\n\n### Online Resources\nFor questions about non-resident corporation accounts, visit canada.ca/taxes-international-business\n\n### Contact Information\n\n#### Within Canada and Continental United States\n- Phone: 1-800-959-5525\n- Hours: Monday to Friday (except holidays), 9 am to 6 pm (local time)\n\n#### From Outside Canada and Continental United States\n- Phone: 613-940-8497\n- Hours: Monday to Friday (except holidays), 9 am to 6 pm (Eastern Standard Time)\n- Note: The CRA only accepts collect calls made through telephone operators. After your call is accepted by an automated response, you may hear a beep and notice a normal connection delay.\n\n### Mailing Address\nFor written correspondence:\n```\nSudbury Tax Centre\nPO Box 20000, STN A\nSudbury ON P3A 5C1\n```\n\nFor developers implementing contact functionality:\n- Include both phone numbers with appropriate country codes\n- Implement time zone conversion for international callers\n- Display the mailing address in a format that can be easily copied or exported\n- Consider adding a feature to check if today is a CRA-recognized holiday before displaying contact hours",
  "original_char_count": 1877,
  "enhanced_char_count": 3058,
  "enhanced_at": "2025-11-04T12:10:55.185739",
  "provider": "glm-api"
}