{
  "chunk_id": 46,
  "title": "Section 112: and subsection 138(6) of the Act allow",
  "slug": "section-112-and-subsection-1386-of-the-act-allow",
  "enhanced_content": "## Intercorporate Dividend Deduction (Section 112 and Subsection 138(6))\n\n### General Rule\nCorporations receiving intercorporate dividends can claim a deduction equal to the amount of dividends received under Section 112 and subsection 138(6) of the Income Tax Act.\n\n### Exception for Financial Institutions (Post-2023)\nFor dividends received or deemed received after 2023, the dividend received deduction under subsections 112(1), 112(2), and 138(6) will be denied for corporations that are financial institutions (as defined in subsection 142.2(1)). This applies to:\n- Shares that are mark-to-market (MTM) property\n- Tracking property of the corporation\n- Shares that would be MTM property if held at any time during the year\n\n**Exception:** This measure generally does not apply to dividends received on taxable preferred shares (as defined in the Income Tax Act).\n\n### Key Definitions\n#### Mark-to-Market (MTM) Property\nShares are considered MTM property when a financial institution holds less than 10% of the vote or value of the corporation that issued the shares.\n\n#### Tracking Property\nA property whose fair market value is determined by reference to certain attributes of another property that would be MTM property if held directly by the corporation.\n\n### Deductible Dividends Under Section 112\nWhen calculating taxable income, corporations can deduct the following types of taxable dividends received:\n- Dividends from a taxable Canadian corporation\n- Dividends from a corporation resident in Canada and controlled by the receiving corporation\n- Dividends (or a portion of them) from a non-resident corporation (other than a foreign affiliate) that has carried on business in Canada continuously since June 18, 1971\n\n### Non-Deductible Dividends Under Section 112\nThe following types of taxable dividends received are not deductible:\n- Dividends from a corporation that is exempt from Part I tax\n- Dividends on collateralized preferred shares (loss rental plans)\n- Dividends that are part of a dividend rental arrangement, as defined in subsection 248(1)\n- Dividends on term preferred shares received by certain financial institutions\n- Dividends on shares guaranteed by a specified financial institution, as described in subsection 112(2.2)\n\n### Practical Examples\n\n#### Example 1: Standard Intercorporate Dividend Deduction\nCorporation A receives $50,000 in dividends from Corporation B, a taxable Canadian corporation. Corporation A can deduct the full $50,000 when calculating its taxable income under section 112.\n\n#### Example 2: Financial Institution with MTM Property\nBank X (a financial institution) holds 5% of the voting shares of Company Y, making these shares MTM property. In 2024, Bank X receives $20,000 in dividends from Company Y. Under the post-2023 rules, Bank X cannot claim the dividend received deduction for this amount.\n\n#### Example 3: Preferred Share Exception\nFinancial Institution Z holds 8% of the preferred shares of Company W, which are classified as taxable preferred shares. Even though these shares would normally be considered MTM property (due to the ownership percentage being less than 10%), the dividends received on these shares remain deductible under the preferred share exception.\n\n#### Example 4: Non-Resident Corporation Dividends\nCanadian Corporation P receives $30,000 in dividends from US Corporation Q, which has been carrying on business in Canada continuously since 1970. Since Corporation Q is not a foreign affiliate and has been operating in Canada since before June 18, 1971, Corporation P can deduct these dividends under section 112.\n\n### Implementation Considerations for Developers\n1. **Financial Institution Identification**: Implement logic to identify if a corporation qualifies as a financial institution under subsection 142.2(1).\n\n2. **MTM Property Classification**: Develop algorithms to determine if shares qualify as MTM property based on ownership percentage (less than 10% of vote or value).\n\n3. **Tracking Property Detection**: Create mechanisms to identify tracking properties based on valuation methods.\n\n4. **Preferred Share Exception**: Implement logic to identify taxable preferred shares as defined in the Income Tax Act.\n\n5. **Dividend Type Classification**: Build functionality to classify dividends according to the deductible and non-deductible categories listed above.\n\n6. **Date-Based Rules**: Ensure the system correctly applies the post-2023 rules for financial institutions.\n\n### References\n- Subsections 112(1), 112(2), and 112(2.1) to 112(2.9)\n- Subsection 138(6)\n- Subsection 142.2(1)\n- Subsection 248(1)",
  "original_char_count": 2220,
  "enhanced_char_count": 4608,
  "enhanced_at": "2025-11-04T12:06:06.087185",
  "provider": "glm-api"
}